{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "user_id = 1110008753489760261\n",
    "tweet_id = 1109874238398320640\n",
    "politic_usa_id = 14792049\n",
    "\n",
    "uri = 'bolt://localhost:7687'\n",
    "driver = GraphDatabase.driver(uri)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_all_tweet_stories():\n",
    "    message = \"\"\"MATCH p=(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {type: 'TWEET'})\n",
    "                 WHERE NOT (start)-[:REPLIED_TO|RETWEETED_FROM]->() AND NOT ()-[:REPLIED_TO|RETWEETED_FROM]->(end)\n",
    "                 WITH *, relationships(p) AS r\n",
    "                 RETURN end.created_at, start.created_at, r\"\"\"\n",
    "    records = driver.session().run(message).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_tweet_story(tweet_id):\n",
    "    message = \"\"\"MATCH p=(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {type: 'TWEET'})\n",
    "                 WHERE NOT (start)-[:REPLIED_TO|RETWEETED_FROM]->() AND NOT ()-[:REPLIED_TO|RETWEETED_FROM]->(end)\n",
    "                 AND start.id = {id}\n",
    "                 WITH *, relationships(p) AS r\n",
    "                 RETURN end.created_at, start.created_at, r\"\"\"\n",
    "    records = driver.session().run(message, id=tweet_id).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_users_who_interacted_at_a_story(tweet_id):\n",
    "    message = \"\"\"MATCH u=(user:User)-[:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet)<-[:TWEETED]-(storyStarter:User)\n",
    "                 WHERE start.id = {id} AND (end.type = 'RETWEET' OR end.type = 'REPLY') AND start.type = 'TWEET'\n",
    "                 RETURN user, storyStarter\"\"\"\n",
    "    records = driver.session().run(message, id=tweet_id).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_stories_where_user_is_involved(user_id):\n",
    "    message = \"\"\"MATCH u=(user:User)-[:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet)<-[:TWEETED]-(storyStarter:User)\n",
    "                 WHERE user.id = {id} or storyStarter.id = {id} AND (end.type = 'RETWEET' OR end.type = 'REPLY') AND start.type = 'TWEET'\n",
    "                 WITH *, relationships(u) as re\n",
    "                 RETURN end, re, start, user, storyStarter\"\"\"\n",
    "    records = driver.session().run(message, id=user_id).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_tweet_chain_ordered_by_time(tweet_id):\n",
    "    # not needed, tweet chains are created in order in the first place\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_stories_made_by_user(user_id):\n",
    "    message = \"\"\"MATCH u=(user:User)-[:TWEETED]->(tweet:Tweet)\n",
    "                 WHERE user.id = {id}\n",
    "                 MATCH p=(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(tweet:Tweet)\n",
    "                 WHERE end.type = 'RETWEET' OR end.type = 'REPLY' AND tweet.type = 'TWEET'\n",
    "                 RETURN u\"\"\"\n",
    "    records = driver.session().run(message, id=user_id).value()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "def retrieve_time_spread_of_tweet_story(tweet_id):\n",
    "    records = retrieve_tweet_story(tweet_id)[0]\n",
    "    start_time = records['start.created_at']\n",
    "    end_time = records['end.created_at']\n",
    "    message = \"Original tweet was posted on %s. \\nLast available reaction was posted on %s.\" % (start_time, end_time)\n",
    "    \n",
    "    return message"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "def trial_and_error(tweet_id):\n",
    "    message = \"\"\"MATCH u=(user:User)-[r:POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: {id}, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "                 WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "                 RETURN user, end.created_at as timestamp\"\"\"\n",
    "    records = driver.session().run(message, id=tweet_id).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_users_from_tweet_story(tweet_id):\n",
    "    message = \"\"\"MATCH u=(user:User)-[r:POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: {id}, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "                 WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "                 RETURN user.screen_name as user, end.created_at as timestamp, storyStarter.screen_name as starter, start.created_at as origin\"\"\"\n",
    "    records = driver.session().run(message, id=tweet_id).data()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "def check_if_source_follows_target(source, target):\n",
    "    message = \"MATCH u=({screen_name: {source}})-[:FOLLOWS]->({screen_name: {target}}) RETURN u\"\n",
    "    records = driver.session().run(message, source=source, target=target).values()\n",
    "    return records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hello\n",
      "[[<Path start=<Node id=77671 labels={'User'} properties={'followers': 354, 'id': 1109874352479047680, 'screen_name': 'erinbaby', 'friends': 457}> end=<Node id=68621 labels={'User'} properties={'followers': 68790, 'id': 14792049, 'screen_name': 'politicususa', 'friends': 4015}> size=1>]]\n"
     ]
    }
   ],
   "source": [
    "if check_if_source_follows_target('erinbaby', 'politicususa'):\n",
    "    print('hello')\n",
    "print(check_if_source_follows_target('erinbaby', 'politicususa'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'BreitbartNews', 'timestamp': 'Mon Mar 25 00:19:26 EET 2019', 'followers': ['GFH_17', 'buckeye36', 'briandconnolly', 'HenryYearwood', 'dyerc2012', '487d341f306c4b3', 'taniece623', 'JimLoonie', 'RobertJ98986257', 'TrueloveWill', 'quantumshadow44', 'BeastOfWood', 'jackdten7172', 'bobby_dread', 'crabbydick', 'Buckzona', 'dbnicholls1', 'tweetwen115', 'JimPolk', 'KathyKomesar', 'bennettLee12', 'JoeAlex2344643', 'abeligbod', 'karinsabatini1', 'Belle3387', 'LeeHilden', 'JOgurek', 'shortman5427', 'Jholmes1968', 'FlybyNovel', 'calling12001', 'excalifsane', 'Shone27218200', 'SmallgovConserv', 'bfuenz14', 'Ana_love050', 'jdltek', 'DavidH692', 'tfedrick', '88reasonswhy', 'RedwardsRobin', 'jshindehite', 'interimspace', 'flyboy7798', 'rockie_springer', 'Tanya10049407', 'Unspinnable', 'GabyJuang', 'TousekE', 'Urireo561', 'KcajNehoc', 'MAGAcovfefe2020', 'mannreagan', 'ftman21', 'lissamac15', 'cloud_lillie', 'etmercado94', 'DannyMesser5', 'rag_koko', 'jpwilloughby', 'GayeRobinson18', 'concernedtwo', 'Dollfinish', 'Bubba_Todd', 'PatriotMarie', 'PennyDeplorable', 'hvacman2009', 'dinsdjw', 'chebert1963']}\n",
      "{'user': 'GFH_17', 'timestamp': 'Mon Mar 25 00:19:58 EET 2019', 'followers': []}\n",
      "{'user': 'buckeye36', 'timestamp': 'Mon Mar 25 00:20:17 EET 2019', 'followers': []}\n",
      "{'user': 'briandconnolly', 'timestamp': 'Mon Mar 25 00:20:26 EET 2019', 'followers': []}\n",
      "{'user': 'HenryYearwood', 'timestamp': 'Mon Mar 25 00:20:40 EET 2019', 'followers': []}\n",
      "{'user': 'dyerc2012', 'timestamp': 'Mon Mar 25 00:21:08 EET 2019', 'followers': ['shortman5427']}\n",
      "{'user': '487d341f306c4b3', 'timestamp': 'Mon Mar 25 00:21:41 EET 2019', 'followers': []}\n",
      "{'user': 'taniece623', 'timestamp': 'Mon Mar 25 00:21:56 EET 2019', 'followers': []}\n",
      "{'user': 'JimLoonie', 'timestamp': 'Mon Mar 25 00:22:12 EET 2019', 'followers': []}\n",
      "{'user': 'PatrickFNSledge', 'timestamp': 'Mon Mar 25 00:22:14 EET 2019', 'followers': []}\n",
      "{'user': 'RobertJ98986257', 'timestamp': 'Mon Mar 25 00:22:43 EET 2019', 'followers': []}\n",
      "{'user': 'TrueloveWill', 'timestamp': 'Mon Mar 25 00:22:44 EET 2019', 'followers': []}\n",
      "{'user': 'quantumshadow44', 'timestamp': 'Mon Mar 25 00:22:53 EET 2019', 'followers': []}\n",
      "{'user': 'BeastOfWood', 'timestamp': 'Mon Mar 25 00:22:53 EET 2019', 'followers': ['melesmemes']}\n",
      "{'user': 'jackdten7172', 'timestamp': 'Mon Mar 25 00:23:02 EET 2019', 'followers': []}\n",
      "{'user': 'bobby_dread', 'timestamp': 'Mon Mar 25 00:23:32 EET 2019', 'followers': []}\n",
      "{'user': 'crabbydick', 'timestamp': 'Mon Mar 25 00:23:55 EET 2019', 'followers': []}\n",
      "{'user': 'Buckzona', 'timestamp': 'Mon Mar 25 00:23:59 EET 2019', 'followers': []}\n",
      "{'user': 'dbnicholls1', 'timestamp': 'Mon Mar 25 00:24:06 EET 2019', 'followers': []}\n",
      "{'user': 'tweetwen115', 'timestamp': 'Mon Mar 25 00:24:32 EET 2019', 'followers': ['RobertJ98986257', 'crabbydick', 'KathyKomesar', 'shortman5427']}\n",
      "{'user': 'JimPolk', 'timestamp': 'Mon Mar 25 00:24:45 EET 2019', 'followers': ['Belle3387', 'shortman5427', 'PatriotMarie']}\n",
      "{'user': 'KathyKomesar', 'timestamp': 'Mon Mar 25 00:25:54 EET 2019', 'followers': ['PatriotMarie']}\n",
      "{'user': 'bennettLee12', 'timestamp': 'Mon Mar 25 00:26:06 EET 2019', 'followers': []}\n",
      "{'user': 'JoeAlex2344643', 'timestamp': 'Mon Mar 25 00:26:22 EET 2019', 'followers': []}\n",
      "{'user': 'melesmemes', 'timestamp': 'Mon Mar 25 00:27:15 EET 2019', 'followers': []}\n",
      "{'user': 'abeligbod', 'timestamp': 'Mon Mar 25 00:27:25 EET 2019', 'followers': []}\n",
      "{'user': 'karinsabatini1', 'timestamp': 'Mon Mar 25 00:27:27 EET 2019', 'followers': []}\n",
      "{'user': 'Belle3387', 'timestamp': 'Mon Mar 25 00:27:39 EET 2019', 'followers': ['shortman5427', 'mannreagan', 'PatriotMarie']}\n",
      "{'user': 'LeeHilden', 'timestamp': 'Mon Mar 25 00:28:34 EET 2019', 'followers': []}\n",
      "{'user': 'JOgurek', 'timestamp': 'Mon Mar 25 00:28:49 EET 2019', 'followers': []}\n",
      "{'user': 'shortman5427', 'timestamp': 'Mon Mar 25 00:29:17 EET 2019', 'followers': ['Belle3387', 'bfuenz14', 'ftman21', 'Dollfinish', 'PennyDeplorable']}\n",
      "{'user': 'Jholmes1968', 'timestamp': 'Mon Mar 25 00:30:22 EET 2019', 'followers': []}\n",
      "{'user': 'buckeye36', 'timestamp': 'Mon Mar 25 00:30:27 EET 2019', 'followers': []}\n",
      "{'user': 'FlybyNovel', 'timestamp': 'Mon Mar 25 00:30:37 EET 2019', 'followers': []}\n",
      "{'user': 'calling12001', 'timestamp': 'Mon Mar 25 00:31:54 EET 2019', 'followers': ['Ana_love050']}\n",
      "{'user': 'excalifsane', 'timestamp': 'Mon Mar 25 00:32:01 EET 2019', 'followers': []}\n",
      "{'user': 'Shone27218200', 'timestamp': 'Mon Mar 25 00:32:11 EET 2019', 'followers': []}\n",
      "{'user': 'SmallgovConserv', 'timestamp': 'Mon Mar 25 00:32:31 EET 2019', 'followers': ['KcajNehoc', 'PatriotMarie']}\n",
      "{'user': 'bfuenz14', 'timestamp': 'Mon Mar 25 00:32:57 EET 2019', 'followers': []}\n",
      "{'user': 'Ana_love050', 'timestamp': 'Mon Mar 25 00:33:19 EET 2019', 'followers': ['rockie_springer', 'ftman21']}\n",
      "{'user': 'jdltek', 'timestamp': 'Mon Mar 25 00:34:03 EET 2019', 'followers': []}\n",
      "{'user': 'DavidH692', 'timestamp': 'Mon Mar 25 00:34:09 EET 2019', 'followers': []}\n",
      "{'user': 'tfedrick', 'timestamp': 'Mon Mar 25 00:34:10 EET 2019', 'followers': []}\n",
      "{'user': '88reasonswhy', 'timestamp': 'Mon Mar 25 00:34:43 EET 2019', 'followers': []}\n",
      "{'user': 'RedwardsRobin', 'timestamp': 'Mon Mar 25 00:35:04 EET 2019', 'followers': []}\n",
      "{'user': 'jshindehite', 'timestamp': 'Mon Mar 25 00:35:46 EET 2019', 'followers': []}\n",
      "{'user': 'interimspace', 'timestamp': 'Mon Mar 25 00:36:36 EET 2019', 'followers': []}\n",
      "{'user': 'jshindehite', 'timestamp': 'Mon Mar 25 00:36:37 EET 2019', 'followers': []}\n",
      "{'user': 'flyboy7798', 'timestamp': 'Mon Mar 25 00:36:56 EET 2019', 'followers': []}\n",
      "{'user': 'rockie_springer', 'timestamp': 'Mon Mar 25 00:37:22 EET 2019', 'followers': []}\n",
      "{'user': 'Tanya10049407', 'timestamp': 'Mon Mar 25 00:38:45 EET 2019', 'followers': []}\n",
      "{'user': 'HUMANprimer', 'timestamp': 'Mon Mar 25 00:39:28 EET 2019', 'followers': []}\n",
      "{'user': 'Unspinnable', 'timestamp': 'Mon Mar 25 00:40:04 EET 2019', 'followers': []}\n",
      "{'user': 'GabyJuang', 'timestamp': 'Mon Mar 25 00:40:14 EET 2019', 'followers': []}\n",
      "{'user': 'TousekE', 'timestamp': 'Mon Mar 25 00:41:09 EET 2019', 'followers': []}\n",
      "{'user': 'Urireo561', 'timestamp': 'Mon Mar 25 00:47:36 EET 2019', 'followers': []}\n",
      "{'user': 'KcajNehoc', 'timestamp': 'Mon Mar 25 00:48:34 EET 2019', 'followers': []}\n",
      "{'user': 'sue104bird', 'timestamp': 'Mon Mar 25 00:50:40 EET 2019', 'followers': []}\n",
      "{'user': 'MAGAcovfefe2020', 'timestamp': 'Mon Mar 25 00:51:02 EET 2019', 'followers': []}\n",
      "{'user': 'mannreagan', 'timestamp': 'Mon Mar 25 00:56:00 EET 2019', 'followers': ['PatriotMarie']}\n",
      "{'user': 'ftman21', 'timestamp': 'Mon Mar 25 00:57:26 EET 2019', 'followers': []}\n",
      "{'user': 'lissamac15', 'timestamp': 'Mon Mar 25 01:00:18 EET 2019', 'followers': []}\n",
      "{'user': 'cloud_lillie', 'timestamp': 'Mon Mar 25 01:02:35 EET 2019', 'followers': ['PatriotMarie']}\n",
      "{'user': 'etmercado94', 'timestamp': 'Mon Mar 25 01:07:38 EET 2019', 'followers': []}\n",
      "{'user': 'DannyMesser5', 'timestamp': 'Mon Mar 25 01:13:40 EET 2019', 'followers': []}\n",
      "{'user': 'rag_koko', 'timestamp': 'Mon Mar 25 01:16:50 EET 2019', 'followers': []}\n",
      "{'user': 'jpwilloughby', 'timestamp': 'Mon Mar 25 01:17:59 EET 2019', 'followers': []}\n",
      "{'user': 'GayeRobinson18', 'timestamp': 'Mon Mar 25 01:20:34 EET 2019', 'followers': []}\n",
      "{'user': 'concernedtwo', 'timestamp': 'Mon Mar 25 01:21:19 EET 2019', 'followers': []}\n",
      "{'user': 'Dollfinish', 'timestamp': 'Mon Mar 25 01:28:38 EET 2019', 'followers': ['PatriotMarie', 'PennyDeplorable']}\n",
      "{'user': 'Bubba_Todd', 'timestamp': 'Mon Mar 25 01:34:58 EET 2019', 'followers': []}\n",
      "{'user': 'PatriotMarie', 'timestamp': 'Mon Mar 25 01:42:59 EET 2019', 'followers': ['taniece623', 'mannreagan', 'cloud_lillie', 'Dollfinish', 'PennyDeplorable']}\n",
      "{'user': 'PennyDeplorable', 'timestamp': 'Mon Mar 25 01:47:48 EET 2019', 'followers': ['Dollfinish', 'PatriotMarie']}\n",
      "{'user': 'hvacman2009', 'timestamp': 'Mon Mar 25 01:48:08 EET 2019', 'followers': []}\n",
      "{'user': 'hvacman2009', 'timestamp': 'Mon Mar 25 02:11:19 EET 2019', 'followers': []}\n",
      "{'user': 'dinsdjw', 'timestamp': 'Mon Mar 25 02:24:34 EET 2019', 'followers': []}\n",
      "{'user': 'chebert1963', 'timestamp': 'Mon Mar 25 07:56:02 EET 2019', 'followers': []}\n",
      "{'user': 'TheDonaldwin', 'timestamp': 'Mon Mar 25 09:05:37 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'ClickHole', 'timestamp': 'Sun Mar 24 23:00:12 EET 2019', 'followers': ['Famulator64', 'prismpiece', 'emilypressy', 'emmett_lui', 'AvatarJohnson', 'OkamiWolf10', 'KenziKardashian', 'OrganJaws', 'Towelprazolam', 'angry_yawns', 'CatherineExpat', 'sean_eick', 'DanSanchez1869']}\n",
      "{'user': 'Famulator64', 'timestamp': 'Sun Mar 24 23:00:30 EET 2019', 'followers': []}\n",
      "{'user': 'prismpiece', 'timestamp': 'Sun Mar 24 23:00:38 EET 2019', 'followers': []}\n",
      "{'user': 'emilypressy', 'timestamp': 'Sun Mar 24 23:01:15 EET 2019', 'followers': []}\n",
      "{'user': 'emmett_lui', 'timestamp': 'Sun Mar 24 23:02:01 EET 2019', 'followers': []}\n",
      "{'user': 'AvatarJohnson', 'timestamp': 'Sun Mar 24 23:02:02 EET 2019', 'followers': []}\n",
      "{'user': 'Vexillariuss', 'timestamp': 'Sun Mar 24 23:02:16 EET 2019', 'followers': []}\n",
      "{'user': 'spoilerlesbians', 'timestamp': 'Sun Mar 24 23:02:32 EET 2019', 'followers': []}\n",
      "{'user': 'OkamiWolf10', 'timestamp': 'Sun Mar 24 23:02:56 EET 2019', 'followers': []}\n",
      "{'user': 'KenziKardashian', 'timestamp': 'Sun Mar 24 23:03:41 EET 2019', 'followers': []}\n",
      "{'user': 'OrganJaws', 'timestamp': 'Sun Mar 24 23:03:44 EET 2019', 'followers': []}\n",
      "{'user': 'Towelprazolam', 'timestamp': 'Sun Mar 24 23:03:53 EET 2019', 'followers': []}\n",
      "{'user': 'angry_yawns', 'timestamp': 'Sun Mar 24 23:04:13 EET 2019', 'followers': []}\n",
      "{'user': 'CatherineExpat', 'timestamp': 'Sun Mar 24 23:05:28 EET 2019', 'followers': []}\n",
      "{'user': 'phased_bemused', 'timestamp': 'Sun Mar 24 23:06:49 EET 2019', 'followers': []}\n",
      "{'user': 'sean_eick', 'timestamp': 'Sun Mar 24 23:09:56 EET 2019', 'followers': []}\n",
      "{'user': 'DanSanchez1869', 'timestamp': 'Sun Mar 24 23:10:03 EET 2019', 'followers': []}\n",
      "{'user': 'koolmcr', 'timestamp': 'Sun Mar 24 23:12:01 EET 2019', 'followers': []}\n",
      "{'user': 'coolgarydotnet', 'timestamp': 'Sun Mar 24 23:13:16 EET 2019', 'followers': []}\n",
      "{'user': 'Jimmy_G_Rektson', 'timestamp': 'Sun Mar 24 23:13:24 EET 2019', 'followers': []}\n",
      "{'user': 'jebwouldvewon', 'timestamp': 'Sun Mar 24 23:15:41 EET 2019', 'followers': []}\n",
      "{'user': 'dablamobackpack', 'timestamp': 'Sun Mar 24 23:16:24 EET 2019', 'followers': []}\n",
      "{'user': 'gnomestu', 'timestamp': 'Sun Mar 24 23:16:28 EET 2019', 'followers': []}\n",
      "{'user': 'echalette', 'timestamp': 'Sun Mar 24 23:26:17 EET 2019', 'followers': []}\n",
      "{'user': 'enurrd', 'timestamp': 'Sun Mar 24 23:29:44 EET 2019', 'followers': []}\n",
      "{'user': 'Shdw_Mnky1224', 'timestamp': 'Sun Mar 24 23:35:27 EET 2019', 'followers': []}\n",
      "{'user': 'OldDustyDeath', 'timestamp': 'Sun Mar 24 23:36:59 EET 2019', 'followers': []}\n",
      "{'user': 'JoshyTweetz', 'timestamp': 'Sun Mar 24 23:37:57 EET 2019', 'followers': []}\n",
      "{'user': 'pixledudle', 'timestamp': 'Sun Mar 24 23:39:25 EET 2019', 'followers': []}\n",
      "{'user': 'JoshyTweetz', 'timestamp': 'Sun Mar 24 23:55:52 EET 2019', 'followers': []}\n",
      "{'user': 'schraderbrau88', 'timestamp': 'Sun Mar 24 23:57:19 EET 2019', 'followers': []}\n",
      "{'user': 'shazelgames', 'timestamp': 'Sun Mar 24 23:58:35 EET 2019', 'followers': []}\n",
      "{'user': 'Lizbeth_Yanezz', 'timestamp': 'Mon Mar 25 00:04:09 EET 2019', 'followers': []}\n",
      "{'user': 'Dllll43022143', 'timestamp': 'Mon Mar 25 00:07:30 EET 2019', 'followers': []}\n",
      "{'user': 'ssertsid', 'timestamp': 'Mon Mar 25 00:21:27 EET 2019', 'followers': []}\n",
      "{'user': 'Saltedsmoke2', 'timestamp': 'Mon Mar 25 00:24:06 EET 2019', 'followers': []}\n",
      "{'user': 'cmadam14', 'timestamp': 'Mon Mar 25 00:32:32 EET 2019', 'followers': []}\n",
      "{'user': 'ainejoycey', 'timestamp': 'Mon Mar 25 00:50:07 EET 2019', 'followers': []}\n",
      "{'user': 'SeaOtterYachter', 'timestamp': 'Mon Mar 25 00:55:46 EET 2019', 'followers': []}\n",
      "{'user': 'shannnon_riley', 'timestamp': 'Mon Mar 25 01:22:29 EET 2019', 'followers': []}\n",
      "{'user': 'SarahxTwice', 'timestamp': 'Mon Mar 25 01:49:04 EET 2019', 'followers': []}\n",
      "{'user': 'MEBlackberg', 'timestamp': 'Mon Mar 25 01:53:40 EET 2019', 'followers': []}\n",
      "{'user': 'TristanSevers', 'timestamp': 'Mon Mar 25 05:17:59 EET 2019', 'followers': []}\n",
      "{'user': 'SluttySam2', 'timestamp': 'Mon Mar 25 05:37:18 EET 2019', 'followers': []}\n",
      "{'user': 'NutritionSpecs', 'timestamp': 'Mon Mar 25 07:51:12 EET 2019', 'followers': []}\n",
      "{'user': 'politicususa', 'timestamp': 'Mon Mar 25 00:22:24 EET 2019', 'followers': ['cld1205', 'arcturus300', 'RSmith1935', 'jimetoo', 'PolitJunkieM', 'robertfranek']}\n",
      "{'user': 'POLILLITAM', 'timestamp': 'Mon Mar 25 00:22:53 EET 2019', 'followers': []}\n",
      "{'user': 'cld1205', 'timestamp': 'Mon Mar 25 00:22:55 EET 2019', 'followers': ['HelpforBear', 'PolitJunkieM']}\n",
      "{'user': 'Russpoljunkie', 'timestamp': 'Mon Mar 25 00:23:01 EET 2019', 'followers': []}\n",
      "{'user': 'CytkoJ', 'timestamp': 'Mon Mar 25 00:23:08 EET 2019', 'followers': []}\n",
      "{'user': 'arcturus300', 'timestamp': 'Mon Mar 25 00:23:10 EET 2019', 'followers': []}\n",
      "{'user': 'HelpforBear', 'timestamp': 'Mon Mar 25 00:24:22 EET 2019', 'followers': []}\n",
      "{'user': 'cmisscarla', 'timestamp': 'Mon Mar 25 00:24:29 EET 2019', 'followers': []}\n",
      "{'user': 'adam46838515', 'timestamp': 'Mon Mar 25 00:28:48 EET 2019', 'followers': []}\n",
      "{'user': 'rpdandy', 'timestamp': 'Mon Mar 25 00:28:51 EET 2019', 'followers': []}\n",
      "{'user': 'epamanamus', 'timestamp': 'Mon Mar 25 00:32:45 EET 2019', 'followers': []}\n",
      "{'user': 'TammyCh49411054', 'timestamp': 'Mon Mar 25 00:41:41 EET 2019', 'followers': []}\n",
      "{'user': 'RSmith1935', 'timestamp': 'Mon Mar 25 00:44:45 EET 2019', 'followers': []}\n",
      "{'user': 'DesbraRon', 'timestamp': 'Mon Mar 25 00:46:06 EET 2019', 'followers': []}\n",
      "{'user': 'Roxy4080', 'timestamp': 'Mon Mar 25 00:46:17 EET 2019', 'followers': []}\n",
      "{'user': 'arctor1984', 'timestamp': 'Mon Mar 25 00:46:27 EET 2019', 'followers': []}\n",
      "{'user': 'corvuss777', 'timestamp': 'Mon Mar 25 00:46:59 EET 2019', 'followers': []}\n",
      "{'user': 'Linusthesheepie', 'timestamp': 'Mon Mar 25 00:54:52 EET 2019', 'followers': []}\n",
      "{'user': 'Zenman1550', 'timestamp': 'Mon Mar 25 00:56:00 EET 2019', 'followers': []}\n",
      "{'user': 'jimetoo', 'timestamp': 'Mon Mar 25 00:56:30 EET 2019', 'followers': []}\n",
      "{'user': 'hotchkiss_jon', 'timestamp': 'Mon Mar 25 00:58:32 EET 2019', 'followers': []}\n",
      "{'user': 'Havilah_V', 'timestamp': 'Mon Mar 25 01:06:40 EET 2019', 'followers': []}\n",
      "{'user': 'reena2013', 'timestamp': 'Mon Mar 25 01:26:43 EET 2019', 'followers': []}\n",
      "{'user': 'JacquelineHine1', 'timestamp': 'Mon Mar 25 01:48:39 EET 2019', 'followers': ['lavenderblue27']}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:50:32 EET 2019', 'followers': []}\n",
      "{'user': 'ivangut85755723', 'timestamp': 'Mon Mar 25 02:01:44 EET 2019', 'followers': []}\n",
      "{'user': 'Blaze_88', 'timestamp': 'Mon Mar 25 02:05:23 EET 2019', 'followers': []}\n",
      "{'user': 'jkirby33', 'timestamp': 'Mon Mar 25 02:12:09 EET 2019', 'followers': []}\n",
      "{'user': 'michaelj121173', 'timestamp': 'Mon Mar 25 02:20:36 EET 2019', 'followers': []}\n",
      "{'user': 'malama00', 'timestamp': 'Mon Mar 25 02:47:29 EET 2019', 'followers': []}\n",
      "{'user': 'robertfranek', 'timestamp': 'Mon Mar 25 03:07:58 EET 2019', 'followers': []}\n",
      "{'user': 'lavenderblue27', 'timestamp': 'Mon Mar 25 03:14:22 EET 2019', 'followers': ['JacquelineHine1']}\n",
      "{'user': 'switchbackimage', 'timestamp': 'Mon Mar 25 03:25:05 EET 2019', 'followers': []}\n",
      "{'user': 'POTUS45stinks', 'timestamp': 'Mon Mar 25 06:17:16 EET 2019', 'followers': []}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Mon Mar 25 07:55:46 EET 2019', 'followers': ['jimetoo']}\n",
      "{'user': 'ClickHole', 'timestamp': 'Mon Mar 25 01:00:12 EET 2019', 'followers': ['Famulator64', 'WolfeReports']}\n",
      "{'user': 'LuvilVEVO', 'timestamp': 'Mon Mar 25 01:00:25 EET 2019', 'followers': []}\n",
      "{'user': 'Famulator64', 'timestamp': 'Mon Mar 25 01:00:28 EET 2019', 'followers': []}\n",
      "{'user': 'lesbiyot', 'timestamp': 'Mon Mar 25 01:00:31 EET 2019', 'followers': []}\n",
      "{'user': 'gbranom106', 'timestamp': 'Mon Mar 25 01:00:33 EET 2019', 'followers': []}\n",
      "{'user': 'cuckbaby', 'timestamp': 'Mon Mar 25 01:00:34 EET 2019', 'followers': []}\n",
      "{'user': 'httpariona', 'timestamp': 'Mon Mar 25 01:00:34 EET 2019', 'followers': []}\n",
      "{'user': 'mcdaddyissues91', 'timestamp': 'Mon Mar 25 01:00:35 EET 2019', 'followers': []}\n",
      "{'user': 'JerryMSus', 'timestamp': 'Mon Mar 25 01:00:42 EET 2019', 'followers': []}\n",
      "{'user': 'blake_english4', 'timestamp': 'Mon Mar 25 01:00:49 EET 2019', 'followers': []}\n",
      "{'user': 'billmeeks', 'timestamp': 'Mon Mar 25 01:00:58 EET 2019', 'followers': []}\n",
      "{'user': 'drawsilla', 'timestamp': 'Mon Mar 25 01:01:00 EET 2019', 'followers': []}\n",
      "{'user': 'ProfessorPyrex', 'timestamp': 'Mon Mar 25 01:01:02 EET 2019', 'followers': []}\n",
      "{'user': 'gaypossum666', 'timestamp': 'Mon Mar 25 01:01:20 EET 2019', 'followers': []}\n",
      "{'user': 'hitherehaidar', 'timestamp': 'Mon Mar 25 01:01:27 EET 2019', 'followers': []}\n",
      "{'user': 'Coldhands2', 'timestamp': 'Mon Mar 25 01:01:30 EET 2019', 'followers': []}\n",
      "{'user': 'colmosna', 'timestamp': 'Mon Mar 25 01:01:46 EET 2019', 'followers': []}\n",
      "{'user': 'shampoosuper', 'timestamp': 'Mon Mar 25 01:01:57 EET 2019', 'followers': []}\n",
      "{'user': 'goune37', 'timestamp': 'Mon Mar 25 01:02:14 EET 2019', 'followers': []}\n",
      "{'user': 'l0stHEAD', 'timestamp': 'Mon Mar 25 01:02:32 EET 2019', 'followers': []}\n",
      "{'user': 'pedroandsbstian', 'timestamp': 'Mon Mar 25 01:02:47 EET 2019', 'followers': []}\n",
      "{'user': 'Shamdasham', 'timestamp': 'Mon Mar 25 01:02:54 EET 2019', 'followers': []}\n",
      "{'user': 'Kairynx', 'timestamp': 'Mon Mar 25 01:02:58 EET 2019', 'followers': []}\n",
      "{'user': 'timotimo96', 'timestamp': 'Mon Mar 25 01:03:16 EET 2019', 'followers': []}\n",
      "{'user': 'dxferris', 'timestamp': 'Mon Mar 25 01:03:21 EET 2019', 'followers': []}\n",
      "{'user': 'maverickminuano', 'timestamp': 'Mon Mar 25 01:03:32 EET 2019', 'followers': []}\n",
      "{'user': 'RiosJose559', 'timestamp': 'Mon Mar 25 01:03:33 EET 2019', 'followers': []}\n",
      "{'user': 'Massiveidiot2', 'timestamp': 'Mon Mar 25 01:03:58 EET 2019', 'followers': []}\n",
      "{'user': 'alexbelloli', 'timestamp': 'Mon Mar 25 01:04:23 EET 2019', 'followers': []}\n",
      "{'user': 'TERRYGETSJIGGY', 'timestamp': 'Mon Mar 25 01:06:00 EET 2019', 'followers': []}\n",
      "{'user': 'Thalyarae_', 'timestamp': 'Mon Mar 25 01:06:01 EET 2019', 'followers': []}\n",
      "{'user': 'SammyVMan', 'timestamp': 'Mon Mar 25 01:06:03 EET 2019', 'followers': []}\n",
      "{'user': 'DaniTheDemon60', 'timestamp': 'Mon Mar 25 01:06:18 EET 2019', 'followers': []}\n",
      "{'user': '_haystackjack_', 'timestamp': 'Mon Mar 25 01:06:47 EET 2019', 'followers': []}\n",
      "{'user': 'The_big_420', 'timestamp': 'Mon Mar 25 01:06:56 EET 2019', 'followers': []}\n",
      "{'user': 'ChiefBeefSosa', 'timestamp': 'Mon Mar 25 01:06:57 EET 2019', 'followers': []}\n",
      "{'user': 'vanimal613', 'timestamp': 'Mon Mar 25 01:07:22 EET 2019', 'followers': []}\n",
      "{'user': 'viedogaems', 'timestamp': 'Mon Mar 25 01:07:48 EET 2019', 'followers': []}\n",
      "{'user': 'neverhappychris', 'timestamp': 'Mon Mar 25 01:08:58 EET 2019', 'followers': []}\n",
      "{'user': 'Zach_9823', 'timestamp': 'Mon Mar 25 01:09:07 EET 2019', 'followers': []}\n",
      "{'user': 'nicholas_yeet', 'timestamp': 'Mon Mar 25 01:09:11 EET 2019', 'followers': []}\n",
      "{'user': 'sateenie', 'timestamp': 'Mon Mar 25 01:09:59 EET 2019', 'followers': []}\n",
      "{'user': 'generatedhandle', 'timestamp': 'Mon Mar 25 01:10:15 EET 2019', 'followers': []}\n",
      "{'user': 'leandroprieto', 'timestamp': 'Mon Mar 25 01:11:07 EET 2019', 'followers': []}\n",
      "{'user': 'LetThereBeLiz', 'timestamp': 'Mon Mar 25 01:11:11 EET 2019', 'followers': []}\n",
      "{'user': 'Alpha_Cunt', 'timestamp': 'Mon Mar 25 01:11:43 EET 2019', 'followers': []}\n",
      "{'user': 'FortierHenry', 'timestamp': 'Mon Mar 25 01:12:06 EET 2019', 'followers': []}\n",
      "{'user': 'isiah_lloyd', 'timestamp': 'Mon Mar 25 01:15:06 EET 2019', 'followers': []}\n",
      "{'user': 'ZeroFacad', 'timestamp': 'Mon Mar 25 01:17:17 EET 2019', 'followers': []}\n",
      "{'user': 'cyberODB', 'timestamp': 'Mon Mar 25 01:18:05 EET 2019', 'followers': []}\n",
      "{'user': 'h0taao', 'timestamp': 'Mon Mar 25 01:20:25 EET 2019', 'followers': []}\n",
      "{'user': 'Branduil', 'timestamp': 'Mon Mar 25 01:20:40 EET 2019', 'followers': []}\n",
      "{'user': 'Radicalramon', 'timestamp': 'Mon Mar 25 01:21:20 EET 2019', 'followers': []}\n",
      "{'user': 'Technocity_MKV', 'timestamp': 'Mon Mar 25 01:21:36 EET 2019', 'followers': []}\n",
      "{'user': 'MissSeamonster', 'timestamp': 'Mon Mar 25 01:21:40 EET 2019', 'followers': []}\n",
      "{'user': 'Neorainbow1219', 'timestamp': 'Mon Mar 25 01:21:48 EET 2019', 'followers': []}\n",
      "{'user': 'dmbestor', 'timestamp': 'Mon Mar 25 01:22:06 EET 2019', 'followers': []}\n",
      "{'user': 'InsaNQN', 'timestamp': 'Mon Mar 25 01:23:20 EET 2019', 'followers': []}\n",
      "{'user': 'MattPeney', 'timestamp': 'Mon Mar 25 01:25:02 EET 2019', 'followers': []}\n",
      "{'user': '____MonoNoAware', 'timestamp': 'Mon Mar 25 01:25:50 EET 2019', 'followers': []}\n",
      "{'user': 'ErikBlevins', 'timestamp': 'Mon Mar 25 01:33:57 EET 2019', 'followers': []}\n",
      "{'user': 'hhxchen', 'timestamp': 'Mon Mar 25 01:45:44 EET 2019', 'followers': []}\n",
      "{'user': 'tomhammell', 'timestamp': 'Mon Mar 25 01:46:02 EET 2019', 'followers': []}\n",
      "{'user': 'nostalgiibra', 'timestamp': 'Mon Mar 25 01:51:05 EET 2019', 'followers': []}\n",
      "{'user': 'Lizbeth_Yanezz', 'timestamp': 'Mon Mar 25 01:54:34 EET 2019', 'followers': []}\n",
      "{'user': 'Piefishroxs', 'timestamp': 'Mon Mar 25 01:55:03 EET 2019', 'followers': []}\n",
      "{'user': 'moldylemona', 'timestamp': 'Mon Mar 25 01:57:39 EET 2019', 'followers': []}\n",
      "{'user': 'WolfeReports', 'timestamp': 'Mon Mar 25 01:59:37 EET 2019', 'followers': []}\n",
      "{'user': '_khalyssi_', 'timestamp': 'Mon Mar 25 02:00:32 EET 2019', 'followers': ['JoshReinke7']}\n",
      "{'user': 'imthecreamsoda', 'timestamp': 'Mon Mar 25 02:01:21 EET 2019', 'followers': []}\n",
      "{'user': 'gibbons17', 'timestamp': 'Mon Mar 25 02:07:41 EET 2019', 'followers': []}\n",
      "{'user': 'vinnabon', 'timestamp': 'Mon Mar 25 02:18:23 EET 2019', 'followers': []}\n",
      "{'user': 'cybersurfed', 'timestamp': 'Mon Mar 25 02:22:28 EET 2019', 'followers': []}\n",
      "{'user': 'ghosterling', 'timestamp': 'Mon Mar 25 02:28:38 EET 2019', 'followers': []}\n",
      "{'user': 'EGuidus', 'timestamp': 'Mon Mar 25 02:30:47 EET 2019', 'followers': []}\n",
      "{'user': 'VeryIsom', 'timestamp': 'Mon Mar 25 02:32:32 EET 2019', 'followers': []}\n",
      "{'user': 'Othermeatlof', 'timestamp': 'Mon Mar 25 02:33:14 EET 2019', 'followers': []}\n",
      "{'user': 'bridgetvelez_', 'timestamp': 'Mon Mar 25 02:35:01 EET 2019', 'followers': []}\n",
      "{'user': 'dnabreaker', 'timestamp': 'Mon Mar 25 02:39:25 EET 2019', 'followers': []}\n",
      "{'user': 'lucarioTHICC', 'timestamp': 'Mon Mar 25 02:45:21 EET 2019', 'followers': []}\n",
      "{'user': 'SPIRlTED_AWAY', 'timestamp': 'Mon Mar 25 03:00:20 EET 2019', 'followers': []}\n",
      "{'user': 'JoshReinke7', 'timestamp': 'Mon Mar 25 03:01:50 EET 2019', 'followers': ['_khalyssi_']}\n",
      "{'user': 'electricnymph', 'timestamp': 'Mon Mar 25 03:17:17 EET 2019', 'followers': []}\n",
      "{'user': 'EpsilonAI80', 'timestamp': 'Mon Mar 25 03:33:20 EET 2019', 'followers': []}\n",
      "{'user': 'JasianXu', 'timestamp': 'Mon Mar 25 03:35:00 EET 2019', 'followers': []}\n",
      "{'user': 'UncouthGod', 'timestamp': 'Mon Mar 25 03:35:41 EET 2019', 'followers': []}\n",
      "{'user': 'owlmazing0v0', 'timestamp': 'Mon Mar 25 03:44:20 EET 2019', 'followers': []}\n",
      "{'user': 'TristanSevers', 'timestamp': 'Mon Mar 25 05:17:48 EET 2019', 'followers': []}\n",
      "{'user': 'LondonGSmith', 'timestamp': 'Mon Mar 25 05:51:39 EET 2019', 'followers': []}\n",
      "{'user': 'kindofacid', 'timestamp': 'Mon Mar 25 06:54:41 EET 2019', 'followers': []}\n",
      "{'user': 'NutritionSpecs', 'timestamp': 'Mon Mar 25 07:50:57 EET 2019', 'followers': []}\n",
      "{'user': '_samm_i', 'timestamp': 'Mon Mar 25 08:15:50 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 16:12:44 EET 2019', 'followers': ['silverthornn264', 'laleumen', 'ascalon5', 'BjayukCat', 'NetNewsBuzz', 'jimetoo', 'PROGRESSIVELIBE', 'cornerboy102000', 'PolitJunkieM']}\n",
      "{'user': 'AndrewRei15', 'timestamp': 'Sun Mar 24 16:14:38 EET 2019', 'followers': []}\n",
      "{'user': 'wyo2step', 'timestamp': 'Sun Mar 24 16:19:42 EET 2019', 'followers': ['DeniseKirchubel', 'RealTwitish', 'inthetao']}\n",
      "{'user': '02catz', 'timestamp': 'Sun Mar 24 16:20:05 EET 2019', 'followers': []}\n",
      "{'user': '02catz', 'timestamp': 'Sun Mar 24 16:20:20 EET 2019', 'followers': []}\n",
      "{'user': 'MoreWhit', 'timestamp': 'Sun Mar 24 16:21:43 EET 2019', 'followers': []}\n",
      "{'user': 'BluRidge4Bernie', 'timestamp': 'Sun Mar 24 16:22:43 EET 2019', 'followers': ['nancypeggy']}\n",
      "{'user': 'BluRidge4Bernie', 'timestamp': 'Sun Mar 24 16:22:46 EET 2019', 'followers': ['nancypeggy']}\n",
      "{'user': 'QuantumHumanity', 'timestamp': 'Sun Mar 24 16:28:27 EET 2019', 'followers': []}\n",
      "{'user': 'ClaudineCaprio7', 'timestamp': 'Sun Mar 24 16:28:43 EET 2019', 'followers': []}\n",
      "{'user': 'Duchampia', 'timestamp': 'Sun Mar 24 16:29:55 EET 2019', 'followers': []}\n",
      "{'user': 'GuruImage', 'timestamp': 'Sun Mar 24 16:31:11 EET 2019', 'followers': []}\n",
      "{'user': 'AdgtgLately', 'timestamp': 'Sun Mar 24 16:32:49 EET 2019', 'followers': []}\n",
      "{'user': 'BlountGblount61', 'timestamp': 'Sun Mar 24 16:33:33 EET 2019', 'followers': []}\n",
      "{'user': 'n0vadust', 'timestamp': 'Sun Mar 24 16:34:15 EET 2019', 'followers': []}\n",
      "{'user': 'n0vadust', 'timestamp': 'Sun Mar 24 16:35:15 EET 2019', 'followers': []}\n",
      "{'user': 'proftrini', 'timestamp': 'Sun Mar 24 16:35:15 EET 2019', 'followers': []}\n",
      "{'user': 'LauraHubka', 'timestamp': 'Sun Mar 24 16:36:27 EET 2019', 'followers': []}\n",
      "{'user': 'Dlt268rt', 'timestamp': 'Sun Mar 24 16:38:18 EET 2019', 'followers': []}\n",
      "{'user': 'POTUS45stinks', 'timestamp': 'Sun Mar 24 16:39:06 EET 2019', 'followers': []}\n",
      "{'user': 'nater81j', 'timestamp': 'Sun Mar 24 16:40:28 EET 2019', 'followers': []}\n",
      "{'user': 'AmanMama', 'timestamp': 'Sun Mar 24 16:41:39 EET 2019', 'followers': ['prospect46', 'dremmelqueen']}\n",
      "{'user': 'usmaan_aisha', 'timestamp': 'Sun Mar 24 16:42:22 EET 2019', 'followers': []}\n",
      "{'user': 'FinanceBuzz', 'timestamp': 'Sun Mar 24 16:43:39 EET 2019', 'followers': []}\n",
      "{'user': 'AhimsaMD', 'timestamp': 'Sun Mar 24 16:48:45 EET 2019', 'followers': []}\n",
      "{'user': 'nancypeggy', 'timestamp': 'Sun Mar 24 16:49:08 EET 2019', 'followers': ['BluRidge4Bernie', 'dremmelqueen']}\n",
      "{'user': 'Ron_in_AZ', 'timestamp': 'Sun Mar 24 16:49:24 EET 2019', 'followers': ['EveylnM67']}\n",
      "{'user': 'silverspoonart', 'timestamp': 'Sun Mar 24 16:50:10 EET 2019', 'followers': ['QuantumHumanity']}\n",
      "{'user': 'lima6ix', 'timestamp': 'Sun Mar 24 16:51:45 EET 2019', 'followers': []}\n",
      "{'user': 'KerriBoxx', 'timestamp': 'Sun Mar 24 16:53:43 EET 2019', 'followers': []}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Sun Mar 24 16:53:54 EET 2019', 'followers': ['jimetoo']}\n",
      "{'user': 'mccuebillie', 'timestamp': 'Sun Mar 24 16:56:05 EET 2019', 'followers': []}\n",
      "{'user': 'KitkatTokyo', 'timestamp': 'Sun Mar 24 16:58:01 EET 2019', 'followers': []}\n",
      "{'user': 'greyhoundpom', 'timestamp': 'Sun Mar 24 16:58:11 EET 2019', 'followers': []}\n",
      "{'user': 'POberembt', 'timestamp': 'Sun Mar 24 16:58:15 EET 2019', 'followers': []}\n",
      "{'user': 'BrennaDawkins', 'timestamp': 'Sun Mar 24 16:58:20 EET 2019', 'followers': []}\n",
      "{'user': 'dzinn1', 'timestamp': 'Sun Mar 24 16:58:32 EET 2019', 'followers': []}\n",
      "{'user': 'JimWest3', 'timestamp': 'Sun Mar 24 16:58:42 EET 2019', 'followers': []}\n",
      "{'user': 'theterryadcock', 'timestamp': 'Sun Mar 24 17:00:43 EET 2019', 'followers': []}\n",
      "{'user': 'valdavon', 'timestamp': 'Sun Mar 24 17:00:54 EET 2019', 'followers': []}\n",
      "{'user': 'rpdandy', 'timestamp': 'Sun Mar 24 17:04:13 EET 2019', 'followers': []}\n",
      "{'user': 'trentdream', 'timestamp': 'Sun Mar 24 17:04:51 EET 2019', 'followers': []}\n",
      "{'user': 'n0vadust', 'timestamp': 'Sun Mar 24 17:04:55 EET 2019', 'followers': []}\n",
      "{'user': 'rpdandy', 'timestamp': 'Sun Mar 24 17:04:59 EET 2019', 'followers': []}\n",
      "{'user': 'StrictlyTEAMS', 'timestamp': 'Sun Mar 24 17:06:19 EET 2019', 'followers': []}\n",
      "{'user': 'MyInfoIngridBe2', 'timestamp': 'Sun Mar 24 17:07:13 EET 2019', 'followers': []}\n",
      "{'user': 'laleumen', 'timestamp': 'Sun Mar 24 17:07:43 EET 2019', 'followers': []}\n",
      "{'user': 'uhlmary1', 'timestamp': 'Sun Mar 24 17:10:33 EET 2019', 'followers': []}\n",
      "{'user': 'lauraatdia', 'timestamp': 'Sun Mar 24 17:11:23 EET 2019', 'followers': []}\n",
      "{'user': 'eve_goes_local', 'timestamp': 'Sun Mar 24 17:11:44 EET 2019', 'followers': []}\n",
      "{'user': 'epamanamus', 'timestamp': 'Sun Mar 24 17:13:29 EET 2019', 'followers': []}\n",
      "{'user': 'LajosneVegh', 'timestamp': 'Sun Mar 24 17:17:28 EET 2019', 'followers': ['BjayukCat']}\n",
      "{'user': 'eju10ma', 'timestamp': 'Sun Mar 24 17:18:31 EET 2019', 'followers': []}\n",
      "{'user': 'MattGrolnic', 'timestamp': 'Sun Mar 24 17:20:39 EET 2019', 'followers': []}\n",
      "{'user': 'eju10ma', 'timestamp': 'Sun Mar 24 17:21:21 EET 2019', 'followers': []}\n",
      "{'user': 'islagiatt4', 'timestamp': 'Sun Mar 24 17:23:47 EET 2019', 'followers': []}\n",
      "{'user': 'TruePatriot4US', 'timestamp': 'Sun Mar 24 17:24:02 EET 2019', 'followers': []}\n",
      "{'user': 'Liamsassy6', 'timestamp': 'Sun Mar 24 17:25:28 EET 2019', 'followers': []}\n",
      "{'user': 'Pam1157', 'timestamp': 'Sun Mar 24 17:25:35 EET 2019', 'followers': []}\n",
      "{'user': 'LynneLupton', 'timestamp': 'Sun Mar 24 17:30:16 EET 2019', 'followers': []}\n",
      "{'user': 'alduk72', 'timestamp': 'Sun Mar 24 17:30:19 EET 2019', 'followers': []}\n",
      "{'user': 'LynneLupton', 'timestamp': 'Sun Mar 24 17:30:38 EET 2019', 'followers': []}\n",
      "{'user': 'say_I_do', 'timestamp': 'Sun Mar 24 17:34:02 EET 2019', 'followers': []}\n",
      "{'user': 'Auntiemels', 'timestamp': 'Sun Mar 24 17:35:19 EET 2019', 'followers': []}\n",
      "{'user': 'VaDivaMom1', 'timestamp': 'Sun Mar 24 17:36:11 EET 2019', 'followers': []}\n",
      "{'user': 'SputterOnline', 'timestamp': 'Sun Mar 24 17:36:36 EET 2019', 'followers': []}\n",
      "{'user': 'joy_nagel68', 'timestamp': 'Sun Mar 24 17:38:17 EET 2019', 'followers': []}\n",
      "{'user': 'MJGarciaKCMO', 'timestamp': 'Sun Mar 24 17:39:11 EET 2019', 'followers': ['redbird2fly']}\n",
      "{'user': 'technoglyf', 'timestamp': 'Sun Mar 24 17:41:05 EET 2019', 'followers': []}\n",
      "{'user': 'silverbract', 'timestamp': 'Sun Mar 24 17:43:19 EET 2019', 'followers': ['ScramGraham']}\n",
      "{'user': 'dyankane2', 'timestamp': 'Sun Mar 24 17:44:03 EET 2019', 'followers': []}\n",
      "{'user': 'Zenman1550', 'timestamp': 'Sun Mar 24 17:44:07 EET 2019', 'followers': []}\n",
      "{'user': 'Zenman1550', 'timestamp': 'Sun Mar 24 17:44:51 EET 2019', 'followers': []}\n",
      "{'user': 'layton514', 'timestamp': 'Sun Mar 24 17:45:34 EET 2019', 'followers': []}\n",
      "{'user': 'ScramGraham', 'timestamp': 'Sun Mar 24 17:46:33 EET 2019', 'followers': []}\n",
      "{'user': 'ScramGraham', 'timestamp': 'Sun Mar 24 17:47:07 EET 2019', 'followers': []}\n",
      "{'user': 'windowjack1945', 'timestamp': 'Sun Mar 24 17:48:44 EET 2019', 'followers': []}\n",
      "{'user': 'MattiamMauro', 'timestamp': 'Sun Mar 24 17:48:44 EET 2019', 'followers': []}\n",
      "{'user': 'violetcloudskye', 'timestamp': 'Sun Mar 24 17:52:55 EET 2019', 'followers': []}\n",
      "{'user': 'Dave1900', 'timestamp': 'Sun Mar 24 17:54:21 EET 2019', 'followers': []}\n",
      "{'user': 'kyvirginaj', 'timestamp': 'Sun Mar 24 17:55:06 EET 2019', 'followers': []}\n",
      "{'user': 'dgarrick5534', 'timestamp': 'Sun Mar 24 17:58:28 EET 2019', 'followers': []}\n",
      "{'user': 'dominick1944', 'timestamp': 'Sun Mar 24 18:02:11 EET 2019', 'followers': []}\n",
      "{'user': 'liveluv707', 'timestamp': 'Sun Mar 24 18:02:39 EET 2019', 'followers': ['trentdream']}\n",
      "{'user': 'tylerelives', 'timestamp': 'Sun Mar 24 18:05:08 EET 2019', 'followers': []}\n",
      "{'user': 'DebraLBrown6', 'timestamp': 'Sun Mar 24 18:05:48 EET 2019', 'followers': ['KatGodspell', 'dots2b']}\n",
      "{'user': 'Rightsof_Man', 'timestamp': 'Sun Mar 24 18:06:05 EET 2019', 'followers': []}\n",
      "{'user': 'DebraLBrown6', 'timestamp': 'Sun Mar 24 18:09:40 EET 2019', 'followers': ['KatGodspell', 'dots2b']}\n",
      "{'user': 'Phillipdrphl', 'timestamp': 'Sun Mar 24 18:13:38 EET 2019', 'followers': []}\n",
      "{'user': 'MistyN2014', 'timestamp': 'Sun Mar 24 18:14:42 EET 2019', 'followers': []}\n",
      "{'user': 'bndsnoopy61', 'timestamp': 'Sun Mar 24 18:18:44 EET 2019', 'followers': ['silverspoonart', 'regsixer']}\n",
      "{'user': 'SimplyMariaC', 'timestamp': 'Sun Mar 24 18:18:54 EET 2019', 'followers': []}\n",
      "{'user': 'FLGATOR20', 'timestamp': 'Sun Mar 24 18:22:46 EET 2019', 'followers': []}\n",
      "{'user': 'ascalon5', 'timestamp': 'Sun Mar 24 18:33:54 EET 2019', 'followers': []}\n",
      "{'user': 'Donnagann4', 'timestamp': 'Sun Mar 24 18:49:50 EET 2019', 'followers': []}\n",
      "{'user': 'TJMCNH2007', 'timestamp': 'Sun Mar 24 18:52:26 EET 2019', 'followers': []}\n",
      "{'user': 'ZenWolfPup', 'timestamp': 'Sun Mar 24 18:54:21 EET 2019', 'followers': ['lnavacali']}\n",
      "{'user': 'BjayukCat', 'timestamp': 'Sun Mar 24 18:58:44 EET 2019', 'followers': []}\n",
      "{'user': 'karenboyce39', 'timestamp': 'Sun Mar 24 18:59:04 EET 2019', 'followers': ['dremmelqueen', 'get_a_spine']}\n",
      "{'user': 'ttonnes', 'timestamp': 'Sun Mar 24 19:00:38 EET 2019', 'followers': []}\n",
      "{'user': 'BjayukCat', 'timestamp': 'Sun Mar 24 19:02:12 EET 2019', 'followers': []}\n",
      "{'user': 'DaveBatschelett', 'timestamp': 'Sun Mar 24 19:04:28 EET 2019', 'followers': []}\n",
      "{'user': 'lnavacali', 'timestamp': 'Sun Mar 24 19:05:41 EET 2019', 'followers': ['ZenWolfPup']}\n",
      "{'user': 'regsixer', 'timestamp': 'Sun Mar 24 19:08:59 EET 2019', 'followers': ['QuantumHumanity', 'silverspoonart', 'bndsnoopy61']}\n",
      "{'user': 'noreenscully_', 'timestamp': 'Sun Mar 24 19:10:54 EET 2019', 'followers': []}\n",
      "{'user': 'voilarie85210', 'timestamp': 'Sun Mar 24 19:13:27 EET 2019', 'followers': []}\n",
      "{'user': 'mejay227', 'timestamp': 'Sun Mar 24 19:20:02 EET 2019', 'followers': []}\n",
      "{'user': 'eab53', 'timestamp': 'Sun Mar 24 19:20:06 EET 2019', 'followers': []}\n",
      "{'user': 'eab53', 'timestamp': 'Sun Mar 24 19:20:10 EET 2019', 'followers': []}\n",
      "{'user': 'JRMRS22', 'timestamp': 'Sun Mar 24 19:28:16 EET 2019', 'followers': []}\n",
      "{'user': 'velsun', 'timestamp': 'Sun Mar 24 19:31:14 EET 2019', 'followers': []}\n",
      "{'user': 'lmf817', 'timestamp': 'Sun Mar 24 19:35:26 EET 2019', 'followers': []}\n",
      "{'user': 'CarmenJ53282807', 'timestamp': 'Sun Mar 24 19:38:41 EET 2019', 'followers': []}\n",
      "{'user': 'NetNewsBuzz', 'timestamp': 'Sun Mar 24 19:38:43 EET 2019', 'followers': ['QuantumHumanity', 'MyInfoIngridBe2', 'FLGATOR20', 'mycarlisle', 'masslady06', 'dremmelqueen', 'PolitJunkieM']}\n",
      "{'user': 'HannahMiyamoto', 'timestamp': 'Sun Mar 24 19:43:14 EET 2019', 'followers': []}\n",
      "{'user': 'WhiteLotus3_9', 'timestamp': 'Sun Mar 24 19:45:51 EET 2019', 'followers': []}\n",
      "{'user': 'TheHadrianShow', 'timestamp': 'Sun Mar 24 19:46:11 EET 2019', 'followers': []}\n",
      "{'user': 'Stephen_A_Roman', 'timestamp': 'Sun Mar 24 19:48:09 EET 2019', 'followers': []}\n",
      "{'user': 'jrbkjrbk', 'timestamp': 'Sun Mar 24 19:49:11 EET 2019', 'followers': []}\n",
      "{'user': 'LopezRose80', 'timestamp': 'Sun Mar 24 19:49:32 EET 2019', 'followers': []}\n",
      "{'user': 'khorah', 'timestamp': 'Sun Mar 24 19:50:42 EET 2019', 'followers': []}\n",
      "{'user': 'MariaJacobelli1', 'timestamp': 'Sun Mar 24 20:02:43 EET 2019', 'followers': []}\n",
      "{'user': 'snagwire', 'timestamp': 'Sun Mar 24 20:03:38 EET 2019', 'followers': []}\n",
      "{'user': 'jkirby33', 'timestamp': 'Sun Mar 24 20:03:54 EET 2019', 'followers': []}\n",
      "{'user': 'CrisNapolitano', 'timestamp': 'Sun Mar 24 20:04:00 EET 2019', 'followers': []}\n",
      "{'user': 'Saltheart77', 'timestamp': 'Sun Mar 24 20:17:51 EET 2019', 'followers': []}\n",
      "{'user': 'dbarcon', 'timestamp': 'Sun Mar 24 20:19:43 EET 2019', 'followers': []}\n",
      "{'user': '575haiku', 'timestamp': 'Sun Mar 24 20:20:02 EET 2019', 'followers': []}\n",
      "{'user': 'cyberflier', 'timestamp': 'Sun Mar 24 20:27:50 EET 2019', 'followers': []}\n",
      "{'user': 'KatGodspell', 'timestamp': 'Sun Mar 24 20:32:20 EET 2019', 'followers': ['DebraLBrown6']}\n",
      "{'user': 'joboomr44', 'timestamp': 'Sun Mar 24 20:33:07 EET 2019', 'followers': []}\n",
      "{'user': 'BruceDBraden22', 'timestamp': 'Sun Mar 24 20:34:21 EET 2019', 'followers': []}\n",
      "{'user': 'boofy1970', 'timestamp': 'Sun Mar 24 20:40:26 EET 2019', 'followers': []}\n",
      "{'user': 'alaskarebel', 'timestamp': 'Sun Mar 24 20:40:44 EET 2019', 'followers': ['JohnABusinger', 'seanmack1025', 'dremmelqueen']}\n",
      "{'user': 'boofy1970', 'timestamp': 'Sun Mar 24 20:41:49 EET 2019', 'followers': []}\n",
      "{'user': 'NIHAustin', 'timestamp': 'Sun Mar 24 20:48:47 EET 2019', 'followers': []}\n",
      "{'user': 'NIHAustin', 'timestamp': 'Sun Mar 24 20:49:06 EET 2019', 'followers': []}\n",
      "{'user': 'CarolynPJensen', 'timestamp': 'Sun Mar 24 20:49:21 EET 2019', 'followers': []}\n",
      "{'user': '1966start', 'timestamp': 'Sun Mar 24 20:50:16 EET 2019', 'followers': []}\n",
      "{'user': 'DougDooganuchi', 'timestamp': 'Sun Mar 24 21:03:12 EET 2019', 'followers': []}\n",
      "{'user': 'Rebelwriter57', 'timestamp': 'Sun Mar 24 21:13:27 EET 2019', 'followers': []}\n",
      "{'user': 'TntWyckoff', 'timestamp': 'Sun Mar 24 21:16:09 EET 2019', 'followers': []}\n",
      "{'user': 'dots2b', 'timestamp': 'Sun Mar 24 21:20:56 EET 2019', 'followers': []}\n",
      "{'user': 'mdfazende', 'timestamp': 'Sun Mar 24 21:23:43 EET 2019', 'followers': []}\n",
      "{'user': 'leftrightlady', 'timestamp': 'Sun Mar 24 21:31:10 EET 2019', 'followers': []}\n",
      "{'user': 'ZweiKatzen', 'timestamp': 'Sun Mar 24 21:36:43 EET 2019', 'followers': []}\n",
      "{'user': 'DeniseKirchubel', 'timestamp': 'Sun Mar 24 21:39:35 EET 2019', 'followers': []}\n",
      "{'user': 'Mi_St526', 'timestamp': 'Sun Mar 24 21:43:19 EET 2019', 'followers': []}\n",
      "{'user': 'SpaceHoolie', 'timestamp': 'Sun Mar 24 22:16:11 EET 2019', 'followers': []}\n",
      "{'user': 'dogsbark2', 'timestamp': 'Sun Mar 24 22:18:21 EET 2019', 'followers': ['RealTwitish']}\n",
      "{'user': 'flowartist57', 'timestamp': 'Sun Mar 24 22:19:16 EET 2019', 'followers': []}\n",
      "{'user': 'DDBURNES', 'timestamp': 'Sun Mar 24 22:25:38 EET 2019', 'followers': []}\n",
      "{'user': 'Pemeadv', 'timestamp': 'Sun Mar 24 22:31:36 EET 2019', 'followers': []}\n",
      "{'user': 'bobbied100', 'timestamp': 'Sun Mar 24 22:42:15 EET 2019', 'followers': []}\n",
      "{'user': 'piano61', 'timestamp': 'Sun Mar 24 22:47:26 EET 2019', 'followers': []}\n",
      "{'user': 'jimetoo', 'timestamp': 'Sun Mar 24 22:48:26 EET 2019', 'followers': []}\n",
      "{'user': 'mycarlisle', 'timestamp': 'Sun Mar 24 22:48:39 EET 2019', 'followers': ['QuantumHumanity']}\n",
      "{'user': 'JohnABusinger', 'timestamp': 'Sun Mar 24 22:52:29 EET 2019', 'followers': ['alaskarebel']}\n",
      "{'user': 'prospect46', 'timestamp': 'Sun Mar 24 22:52:49 EET 2019', 'followers': ['AmanMama']}\n",
      "{'user': 'mikebach2', 'timestamp': 'Sun Mar 24 22:52:53 EET 2019', 'followers': []}\n",
      "{'user': 'masslady06', 'timestamp': 'Sun Mar 24 22:55:10 EET 2019', 'followers': ['QuantumHumanity', 'dremmelqueen', 'arkreader', 'fastwriter2', 'imawahineWA']}\n",
      "{'user': 'Flywoman1950', 'timestamp': 'Sun Mar 24 23:04:06 EET 2019', 'followers': []}\n",
      "{'user': 'HeadlineZooo', 'timestamp': 'Sun Mar 24 23:07:32 EET 2019', 'followers': []}\n",
      "{'user': '64Dmorales', 'timestamp': 'Sun Mar 24 23:15:23 EET 2019', 'followers': []}\n",
      "{'user': 'PROGRESSIVELIBE', 'timestamp': 'Sun Mar 24 23:15:59 EET 2019', 'followers': []}\n",
      "{'user': 'FloridaMinion', 'timestamp': 'Sun Mar 24 23:36:44 EET 2019', 'followers': []}\n",
      "{'user': 'seanmack1025', 'timestamp': 'Sun Mar 24 23:41:36 EET 2019', 'followers': ['alaskarebel']}\n",
      "{'user': 'saintcats', 'timestamp': 'Sun Mar 24 23:50:02 EET 2019', 'followers': []}\n",
      "{'user': 'HerLaptop112', 'timestamp': 'Sun Mar 24 23:56:54 EET 2019', 'followers': []}\n",
      "{'user': 'EveylnM67', 'timestamp': 'Sun Mar 24 23:59:38 EET 2019', 'followers': []}\n",
      "{'user': 'RealTwitish', 'timestamp': 'Mon Mar 25 00:06:25 EET 2019', 'followers': ['rbsralaw']}\n",
      "{'user': 'SalVadacchino1', 'timestamp': 'Mon Mar 25 00:07:22 EET 2019', 'followers': []}\n",
      "{'user': 'inthetao', 'timestamp': 'Mon Mar 25 00:19:10 EET 2019', 'followers': ['wyo2step', 'RealTwitish']}\n",
      "{'user': 'Havilah_V', 'timestamp': 'Mon Mar 25 00:23:38 EET 2019', 'followers': []}\n",
      "{'user': 'Kennethalj', 'timestamp': 'Mon Mar 25 00:25:37 EET 2019', 'followers': []}\n",
      "{'user': 'simonmyers4', 'timestamp': 'Mon Mar 25 00:25:50 EET 2019', 'followers': []}\n",
      "{'user': 'dremmelqueen', 'timestamp': 'Mon Mar 25 00:27:18 EET 2019', 'followers': ['MoreWhit', 'AmanMama', 'nancypeggy', 'silverspoonart', 'dyankane2', 'tylerelives', 'FLGATOR20', 'NetNewsBuzz', '575haiku', 'alaskarebel', 'Pemeadv', 'masslady06', 'inthetao', 'redbird2fly', 'PolitJunkieM', 'fastwriter2', 'dsd8404']}\n",
      "{'user': 'cornerboy102000', 'timestamp': 'Mon Mar 25 01:00:49 EET 2019', 'followers': []}\n",
      "{'user': 'arkreader', 'timestamp': 'Mon Mar 25 01:19:39 EET 2019', 'followers': ['KatGodspell', 'masslady06', 'RealTwitish', 'redbird2fly']}\n",
      "{'user': 'HollyGilder', 'timestamp': 'Mon Mar 25 01:20:56 EET 2019', 'followers': []}\n",
      "{'user': 'redbird2fly', 'timestamp': 'Mon Mar 25 01:25:23 EET 2019', 'followers': ['AmanMama', 'lmf817', 'dremmelqueen']}\n",
      "{'user': 'SchulerKristy', 'timestamp': 'Mon Mar 25 01:45:51 EET 2019', 'followers': []}\n",
      "{'user': 'SchulerKristy', 'timestamp': 'Mon Mar 25 01:45:55 EET 2019', 'followers': []}\n",
      "{'user': 'DaBruteRules', 'timestamp': 'Mon Mar 25 01:49:03 EET 2019', 'followers': []}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:53:19 EET 2019', 'followers': ['NetNewsBuzz']}\n",
      "{'user': 'DavidDGriffith', 'timestamp': 'Mon Mar 25 01:57:51 EET 2019', 'followers': []}\n",
      "{'user': 'BobCleanairbob', 'timestamp': 'Mon Mar 25 02:01:42 EET 2019', 'followers': []}\n",
      "{'user': 'LaBoyStudios', 'timestamp': 'Mon Mar 25 02:25:25 EET 2019', 'followers': []}\n",
      "{'user': 'fastwriter2', 'timestamp': 'Mon Mar 25 02:29:10 EET 2019', 'followers': []}\n",
      "{'user': 'fastwriter2', 'timestamp': 'Mon Mar 25 02:29:12 EET 2019', 'followers': []}\n",
      "{'user': 'nocalray', 'timestamp': 'Mon Mar 25 02:47:49 EET 2019', 'followers': []}\n",
      "{'user': 'SpyDoggie', 'timestamp': 'Mon Mar 25 02:58:17 EET 2019', 'followers': []}\n",
      "{'user': 'BerntJohnson', 'timestamp': 'Mon Mar 25 03:05:04 EET 2019', 'followers': []}\n",
      "{'user': 'imawahineWA', 'timestamp': 'Mon Mar 25 03:06:42 EET 2019', 'followers': []}\n",
      "{'user': 'francot56', 'timestamp': 'Mon Mar 25 03:14:31 EET 2019', 'followers': []}\n",
      "{'user': 'smurch1029', 'timestamp': 'Mon Mar 25 03:39:56 EET 2019', 'followers': []}\n",
      "{'user': 'get_a_spine', 'timestamp': 'Mon Mar 25 04:03:47 EET 2019', 'followers': []}\n",
      "{'user': 'tristanjtom', 'timestamp': 'Mon Mar 25 04:47:35 EET 2019', 'followers': []}\n",
      "{'user': '65Beth', 'timestamp': 'Mon Mar 25 04:51:46 EET 2019', 'followers': []}\n",
      "{'user': 'leislgirl', 'timestamp': 'Mon Mar 25 04:54:23 EET 2019', 'followers': []}\n",
      "{'user': 'rbsralaw', 'timestamp': 'Mon Mar 25 05:08:24 EET 2019', 'followers': ['RealTwitish']}\n",
      "{'user': 'davehluchy', 'timestamp': 'Mon Mar 25 05:22:47 EET 2019', 'followers': []}\n",
      "{'user': 'trilingual1946', 'timestamp': 'Mon Mar 25 06:10:21 EET 2019', 'followers': []}\n",
      "{'user': 'dsd8404', 'timestamp': 'Mon Mar 25 06:14:59 EET 2019', 'followers': ['RealTwitish', 'dremmelqueen']}\n",
      "{'user': 'annedelim', 'timestamp': 'Mon Mar 25 07:31:14 EET 2019', 'followers': []}\n",
      "{'user': 'annedelim', 'timestamp': 'Mon Mar 25 08:47:10 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 12:15:04 EET 2019', 'followers': ['Edgutk', 'StockScout1', 'vinkoview', 'genezog7', 'cld1205', 'silverthornn264', 'arcturus300', 'Mleeds2048', 'jimetoo']}\n",
      "{'user': 'ghostdansing', 'timestamp': 'Sun Mar 24 12:16:25 EET 2019', 'followers': []}\n",
      "{'user': 'jpcrowe_crowe', 'timestamp': 'Sun Mar 24 12:16:44 EET 2019', 'followers': []}\n",
      "{'user': 'Edgutk', 'timestamp': 'Sun Mar 24 12:18:37 EET 2019', 'followers': ['vinkoview']}\n",
      "{'user': 'keconlan', 'timestamp': 'Sun Mar 24 12:19:11 EET 2019', 'followers': []}\n",
      "{'user': 'StockScout1', 'timestamp': 'Sun Mar 24 12:19:36 EET 2019', 'followers': []}\n",
      "{'user': 'mhai56', 'timestamp': 'Sun Mar 24 12:19:52 EET 2019', 'followers': []}\n",
      "{'user': 'cmoretti520', 'timestamp': 'Sun Mar 24 12:23:24 EET 2019', 'followers': []}\n",
      "{'user': 'ColleenIrishLas', 'timestamp': 'Sun Mar 24 12:23:33 EET 2019', 'followers': []}\n",
      "{'user': 'Indyria57Maria', 'timestamp': 'Sun Mar 24 12:23:49 EET 2019', 'followers': ['Betterw05759703']}\n",
      "{'user': 'bndsnoopy61', 'timestamp': 'Sun Mar 24 12:23:51 EET 2019', 'followers': []}\n",
      "{'user': 'BarusArus', 'timestamp': 'Sun Mar 24 12:24:43 EET 2019', 'followers': ['mikelm31', 'acehanna54']}\n",
      "{'user': 'Serena_Spencer', 'timestamp': 'Sun Mar 24 12:26:37 EET 2019', 'followers': []}\n",
      "{'user': 'JamesTLockhart', 'timestamp': 'Sun Mar 24 12:26:44 EET 2019', 'followers': []}\n",
      "{'user': 'DangerClose16', 'timestamp': 'Sun Mar 24 12:39:51 EET 2019', 'followers': []}\n",
      "{'user': 'chipwattsinterp', 'timestamp': 'Sun Mar 24 12:41:09 EET 2019', 'followers': []}\n",
      "{'user': 'vinkoview', 'timestamp': 'Sun Mar 24 12:45:06 EET 2019', 'followers': []}\n",
      "{'user': 'genezog7', 'timestamp': 'Sun Mar 24 12:50:07 EET 2019', 'followers': []}\n",
      "{'user': 'mamalocaz', 'timestamp': 'Sun Mar 24 12:52:27 EET 2019', 'followers': ['Indyria57Maria']}\n",
      "{'user': 'Betterw05759703', 'timestamp': 'Sun Mar 24 13:03:00 EET 2019', 'followers': ['Indyria57Maria', 'catherineanntuc', 'acehanna54', 'Impeach_Hate']}\n",
      "{'user': 'Betterw05759703', 'timestamp': 'Sun Mar 24 13:03:25 EET 2019', 'followers': ['Indyria57Maria', 'catherineanntuc', 'acehanna54', 'Impeach_Hate']}\n",
      "{'user': 'ClassicCherub', 'timestamp': 'Sun Mar 24 13:12:21 EET 2019', 'followers': []}\n",
      "{'user': 'mossman404', 'timestamp': 'Sun Mar 24 13:19:59 EET 2019', 'followers': []}\n",
      "{'user': 'MarkJam92731126', 'timestamp': 'Sun Mar 24 13:25:42 EET 2019', 'followers': []}\n",
      "{'user': 'PSchrager', 'timestamp': 'Sun Mar 24 13:26:25 EET 2019', 'followers': []}\n",
      "{'user': 'melvin3232', 'timestamp': 'Sun Mar 24 13:30:30 EET 2019', 'followers': []}\n",
      "{'user': 'Roxy4080', 'timestamp': 'Sun Mar 24 13:38:01 EET 2019', 'followers': []}\n",
      "{'user': 'mikelm31', 'timestamp': 'Sun Mar 24 13:43:12 EET 2019', 'followers': ['Edgutk', 'StockScout1', 'BarusArus', 'cld1205', 'acehanna54', 'jimetoo']}\n",
      "{'user': 'LindaSN0228WI', 'timestamp': 'Sun Mar 24 13:51:17 EET 2019', 'followers': []}\n",
      "{'user': 'cld1205', 'timestamp': 'Sun Mar 24 13:52:25 EET 2019', 'followers': ['StockScout1']}\n",
      "{'user': 'catherineanntuc', 'timestamp': 'Sun Mar 24 13:53:04 EET 2019', 'followers': []}\n",
      "{'user': 'acehanna54', 'timestamp': 'Sun Mar 24 13:54:59 EET 2019', 'followers': []}\n",
      "{'user': 'acehanna54', 'timestamp': 'Sun Mar 24 13:55:07 EET 2019', 'followers': []}\n",
      "{'user': 'richwithright', 'timestamp': 'Sun Mar 24 14:17:10 EET 2019', 'followers': []}\n",
      "{'user': 'Impeach_Hate', 'timestamp': 'Sun Mar 24 14:23:16 EET 2019', 'followers': []}\n",
      "{'user': 'jrbkjrbk', 'timestamp': 'Sun Mar 24 14:51:22 EET 2019', 'followers': []}\n",
      "{'user': 'Yolie_Rios', 'timestamp': 'Sun Mar 24 15:15:56 EET 2019', 'followers': []}\n",
      "{'user': 'boydfrances33', 'timestamp': 'Sun Mar 24 15:16:12 EET 2019', 'followers': []}\n",
      "{'user': 'Genie2', 'timestamp': 'Sun Mar 24 15:20:46 EET 2019', 'followers': []}\n",
      "{'user': 'Kitwyk', 'timestamp': 'Sun Mar 24 16:14:47 EET 2019', 'followers': []}\n",
      "{'user': 'lavenderblue27', 'timestamp': 'Sun Mar 24 16:57:51 EET 2019', 'followers': []}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Sun Mar 24 17:09:36 EET 2019', 'followers': ['jimetoo']}\n",
      "{'user': 'CurtGaudi', 'timestamp': 'Sun Mar 24 18:03:12 EET 2019', 'followers': []}\n",
      "{'user': 'Mike_Charles', 'timestamp': 'Sun Mar 24 19:29:02 EET 2019', 'followers': []}\n",
      "{'user': 'arcturus300', 'timestamp': 'Sun Mar 24 20:41:36 EET 2019', 'followers': []}\n",
      "{'user': 'michaelj121173', 'timestamp': 'Sun Mar 24 23:54:05 EET 2019', 'followers': []}\n",
      "{'user': 'Mleeds2048', 'timestamp': 'Mon Mar 25 01:48:09 EET 2019', 'followers': []}\n",
      "{'user': 'jimetoo', 'timestamp': 'Mon Mar 25 01:53:41 EET 2019', 'followers': []}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:54:21 EET 2019', 'followers': []}\n",
      "{'user': 'jeen4tae', 'timestamp': 'Sun Mar 24 08:48:48 EET 2019', 'followers': ['ali_graf']}\n",
      "{'user': 'faifu_twt', 'timestamp': 'Sun Mar 24 10:15:46 EET 2019', 'followers': []}\n",
      "{'user': 'PtM_K_95', 'timestamp': 'Sun Mar 24 10:18:01 EET 2019', 'followers': []}\n",
      "{'user': 'xftxer167', 'timestamp': 'Sun Mar 24 10:26:53 EET 2019', 'followers': []}\n",
      "{'user': 'myheartistaetae', 'timestamp': 'Sun Mar 24 10:29:34 EET 2019', 'followers': []}\n",
      "{'user': 'mooknamfon', 'timestamp': 'Sun Mar 24 10:35:35 EET 2019', 'followers': []}\n",
      "{'user': 'ringmyboo', 'timestamp': 'Sun Mar 24 11:04:36 EET 2019', 'followers': []}\n",
      "{'user': 'pantirax95', 'timestamp': 'Sun Mar 24 11:07:24 EET 2019', 'followers': []}\n",
      "{'user': 'pirupuri', 'timestamp': 'Sun Mar 24 11:08:15 EET 2019', 'followers': []}\n",
      "{'user': 'beargodx', 'timestamp': 'Sun Mar 24 11:17:46 EET 2019', 'followers': []}\n",
      "{'user': '0016Nia', 'timestamp': 'Sun Mar 24 11:22:19 EET 2019', 'followers': []}\n",
      "{'user': 'taearn03', 'timestamp': 'Sun Mar 24 11:25:40 EET 2019', 'followers': []}\n",
      "{'user': 'Dongkeystar07', 'timestamp': 'Sun Mar 24 11:30:30 EET 2019', 'followers': []}\n",
      "{'user': '_ppppupe_', 'timestamp': 'Sun Mar 24 11:55:31 EET 2019', 'followers': []}\n",
      "{'user': 'bhumi1304', 'timestamp': 'Sun Mar 24 12:05:33 EET 2019', 'followers': []}\n",
      "{'user': 'guchobpeeniceka', 'timestamp': 'Sun Mar 24 13:14:10 EET 2019', 'followers': []}\n",
      "{'user': 'typemyacc', 'timestamp': 'Sun Mar 24 13:42:37 EET 2019', 'followers': []}\n",
      "{'user': 'fromkcnp_', 'timestamp': 'Sun Mar 24 13:50:56 EET 2019', 'followers': []}\n",
      "{'user': 'ZhbamP', 'timestamp': 'Sun Mar 24 13:58:36 EET 2019', 'followers': []}\n",
      "{'user': 'epohnom_', 'timestamp': 'Sun Mar 24 14:04:02 EET 2019', 'followers': []}\n",
      "{'user': 'myanpanmanisjk_', 'timestamp': 'Sun Mar 24 14:06:51 EET 2019', 'followers': []}\n",
      "{'user': 'Kaaaaai96', 'timestamp': 'Sun Mar 24 14:24:34 EET 2019', 'followers': []}\n",
      "{'user': 'momo_aochi', 'timestamp': 'Sun Mar 24 14:25:57 EET 2019', 'followers': []}\n",
      "{'user': 'infiremanyeah', 'timestamp': 'Sun Mar 24 15:37:29 EET 2019', 'followers': []}\n",
      "{'user': 'Star_Chim99', 'timestamp': 'Sun Mar 24 16:29:48 EET 2019', 'followers': []}\n",
      "{'user': 'MengjieJJ', 'timestamp': 'Sun Mar 24 19:53:03 EET 2019', 'followers': []}\n",
      "{'user': 'ali_graf', 'timestamp': 'Sun Mar 24 20:23:39 EET 2019', 'followers': []}\n",
      "{'user': 'kookV_ArmyBts', 'timestamp': 'Mon Mar 25 01:11:46 EET 2019', 'followers': []}\n",
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 20:58:53 EET 2019', 'followers': ['syringa11', 'gramophoneman', 'NetNewsBuzz', 'souzi54', 'ascalon5', 'cmpnwtr', 'Arriadna', 'barbara_kobrin', 'maggievoelker', 'MerleJennings18', 'RSmith1935', 'jruha', 'JohnnyHeldt', 'jimetoo', 'PolitJunkieM']}\n",
      "{'user': 'CBJinDC', 'timestamp': 'Sun Mar 24 20:59:31 EET 2019', 'followers': []}\n",
      "{'user': 'Texas_Savant', 'timestamp': 'Sun Mar 24 21:00:14 EET 2019', 'followers': []}\n",
      "{'user': 'gfs918', 'timestamp': 'Sun Mar 24 21:00:19 EET 2019', 'followers': []}\n",
      "{'user': 'esthersandra', 'timestamp': 'Sun Mar 24 21:00:52 EET 2019', 'followers': []}\n",
      "{'user': 'TheSusieQue', 'timestamp': 'Sun Mar 24 21:01:25 EET 2019', 'followers': []}\n",
      "{'user': 'm2in84', 'timestamp': 'Sun Mar 24 21:02:20 EET 2019', 'followers': ['garlandgates', 'TerrellDLewis']}\n",
      "{'user': 'RuthRGreenwood', 'timestamp': 'Sun Mar 24 21:02:25 EET 2019', 'followers': []}\n",
      "{'user': 'PwrToThePpl', 'timestamp': 'Sun Mar 24 21:02:39 EET 2019', 'followers': ['anita91504736']}\n",
      "{'user': 'syringa11', 'timestamp': 'Sun Mar 24 21:03:26 EET 2019', 'followers': []}\n",
      "{'user': 'gramophoneman', 'timestamp': 'Sun Mar 24 21:03:54 EET 2019', 'followers': []}\n",
      "{'user': 'ANelson007', 'timestamp': 'Sun Mar 24 21:04:05 EET 2019', 'followers': []}\n",
      "{'user': 'ps9714', 'timestamp': 'Sun Mar 24 21:05:34 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe', 'DiJohnson15']}\n",
      "{'user': 'anita91504736', 'timestamp': 'Sun Mar 24 21:06:45 EET 2019', 'followers': ['loudthorpe']}\n",
      "{'user': 'pbrowning02', 'timestamp': 'Sun Mar 24 21:07:02 EET 2019', 'followers': []}\n",
      "{'user': 'tari1231', 'timestamp': 'Sun Mar 24 21:07:15 EET 2019', 'followers': []}\n",
      "{'user': 'RodgerRodge', 'timestamp': 'Sun Mar 24 21:07:22 EET 2019', 'followers': []}\n",
      "{'user': 'msmunro201', 'timestamp': 'Sun Mar 24 21:07:56 EET 2019', 'followers': ['claypaulnobles']}\n",
      "{'user': 'discjocke52', 'timestamp': 'Sun Mar 24 21:09:04 EET 2019', 'followers': ['m2in84']}\n",
      "{'user': 'HawaiiShira', 'timestamp': 'Sun Mar 24 21:09:05 EET 2019', 'followers': []}\n",
      "{'user': 'MalMcguigan', 'timestamp': 'Sun Mar 24 21:10:45 EET 2019', 'followers': []}\n",
      "{'user': 'VoteEarlyNow', 'timestamp': 'Sun Mar 24 21:11:11 EET 2019', 'followers': ['loudthorpe']}\n",
      "{'user': 'reena2013', 'timestamp': 'Sun Mar 24 21:13:00 EET 2019', 'followers': []}\n",
      "{'user': 'frannygtops', 'timestamp': 'Sun Mar 24 21:13:26 EET 2019', 'followers': []}\n",
      "{'user': 'Tahsudasj', 'timestamp': 'Sun Mar 24 21:13:51 EET 2019', 'followers': []}\n",
      "{'user': 'TammyCh49411054', 'timestamp': 'Sun Mar 24 21:14:19 EET 2019', 'followers': []}\n",
      "{'user': 'Kitwyk', 'timestamp': 'Sun Mar 24 21:15:18 EET 2019', 'followers': []}\n",
      "{'user': 'NetNewsBuzz', 'timestamp': 'Sun Mar 24 21:16:03 EET 2019', 'followers': ['HawaiiShira', 'mpgarza2012', 'supertaschablue', 'FLGATOR20', 'PolitJunkieM']}\n",
      "{'user': 'souzi54', 'timestamp': 'Sun Mar 24 21:16:47 EET 2019', 'followers': ['onahunttoday']}\n",
      "{'user': 'claypaulnobles', 'timestamp': 'Sun Mar 24 21:16:54 EET 2019', 'followers': ['mpgarza2012', 'zettie_geez', 'tweetogram']}\n",
      "{'user': 'Dzana1407', 'timestamp': 'Sun Mar 24 21:17:16 EET 2019', 'followers': ['mpgarza2012']}\n",
      "{'user': 'mpgarza2012', 'timestamp': 'Sun Mar 24 21:18:00 EET 2019', 'followers': ['claypaulnobles', 'paquettee', 'JIFlagg2', 'supertaschablue', 'aktwolinarodu', 'MichaelaHuber11', 'papabea61527924', 'pjharg66', 'marycleary53']}\n",
      "{'user': 'phillipkmccarty', 'timestamp': 'Sun Mar 24 21:18:06 EET 2019', 'followers': []}\n",
      "{'user': 'emywaz', 'timestamp': 'Sun Mar 24 21:18:19 EET 2019', 'followers': []}\n",
      "{'user': 'paquettee', 'timestamp': 'Sun Mar 24 21:18:40 EET 2019', 'followers': ['mpgarza2012']}\n",
      "{'user': 'ClarkReidSF', 'timestamp': 'Sun Mar 24 21:18:59 EET 2019', 'followers': []}\n",
      "{'user': 'ascalon5', 'timestamp': 'Sun Mar 24 21:19:49 EET 2019', 'followers': []}\n",
      "{'user': 'JIFlagg2', 'timestamp': 'Sun Mar 24 21:20:12 EET 2019', 'followers': ['mpgarza2012']}\n",
      "{'user': 'cmpnwtr', 'timestamp': 'Sun Mar 24 21:20:17 EET 2019', 'followers': []}\n",
      "{'user': 'ascalon5', 'timestamp': 'Sun Mar 24 21:20:42 EET 2019', 'followers': []}\n",
      "{'user': 'supertaschablue', 'timestamp': 'Sun Mar 24 21:21:22 EET 2019', 'followers': ['mpgarza2012']}\n",
      "{'user': '2Freelancer', 'timestamp': 'Sun Mar 24 21:22:51 EET 2019', 'followers': ['Backstorymom1']}\n",
      "{'user': 'silverbract', 'timestamp': 'Sun Mar 24 21:23:15 EET 2019', 'followers': []}\n",
      "{'user': 'aktwolinarodu', 'timestamp': 'Sun Mar 24 21:23:37 EET 2019', 'followers': []}\n",
      "{'user': 'zettie_geez', 'timestamp': 'Sun Mar 24 21:26:01 EET 2019', 'followers': ['claypaulnobles']}\n",
      "{'user': 'MichaelaHuber11', 'timestamp': 'Sun Mar 24 21:26:27 EET 2019', 'followers': []}\n",
      "{'user': 'tweetogram', 'timestamp': 'Sun Mar 24 21:27:17 EET 2019', 'followers': ['claypaulnobles']}\n",
      "{'user': 'papabea61527924', 'timestamp': 'Sun Mar 24 21:27:36 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe']}\n",
      "{'user': 'DuhartKimberlie', 'timestamp': 'Sun Mar 24 21:28:13 EET 2019', 'followers': []}\n",
      "{'user': 'zettie_geez', 'timestamp': 'Sun Mar 24 21:30:14 EET 2019', 'followers': ['claypaulnobles']}\n",
      "{'user': 'Javd0g2ooo', 'timestamp': 'Sun Mar 24 21:30:23 EET 2019', 'followers': []}\n",
      "{'user': 'pjharg66', 'timestamp': 'Sun Mar 24 21:30:38 EET 2019', 'followers': []}\n",
      "{'user': 'Phaedrejax', 'timestamp': 'Sun Mar 24 21:33:31 EET 2019', 'followers': []}\n",
      "{'user': 'ccberrudd', 'timestamp': 'Sun Mar 24 21:35:06 EET 2019', 'followers': []}\n",
      "{'user': 'sjosephs53', 'timestamp': 'Sun Mar 24 21:35:49 EET 2019', 'followers': []}\n",
      "{'user': 'ccberrudd', 'timestamp': 'Sun Mar 24 21:36:29 EET 2019', 'followers': []}\n",
      "{'user': 'psstricia', 'timestamp': 'Sun Mar 24 21:38:08 EET 2019', 'followers': ['tbrennan666', 'loudthorpe']}\n",
      "{'user': 'tbrennan666', 'timestamp': 'Sun Mar 24 21:39:43 EET 2019', 'followers': []}\n",
      "{'user': 'ce9461', 'timestamp': 'Sun Mar 24 21:40:29 EET 2019', 'followers': []}\n",
      "{'user': 'Arriadna', 'timestamp': 'Sun Mar 24 21:41:19 EET 2019', 'followers': ['MerleJennings18']}\n",
      "{'user': 'garlandgates', 'timestamp': 'Sun Mar 24 21:41:24 EET 2019', 'followers': []}\n",
      "{'user': 'nerakk57', 'timestamp': 'Sun Mar 24 21:43:36 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe']}\n",
      "{'user': 'loudthorpe', 'timestamp': 'Sun Mar 24 21:43:53 EET 2019', 'followers': ['mpgarza2012', 'papabea61527924', 'marycleary53', 'pattyww8518', 'MarciaJ91882912', 'oliverg2014', 'DiJohnson15']}\n",
      "{'user': 'marycleary53', 'timestamp': 'Sun Mar 24 21:45:18 EET 2019', 'followers': ['Arriadna']}\n",
      "{'user': 'pattyww8518', 'timestamp': 'Sun Mar 24 21:45:37 EET 2019', 'followers': []}\n",
      "{'user': 'donnac58', 'timestamp': 'Sun Mar 24 21:46:43 EET 2019', 'followers': ['MarciaJ91882912']}\n",
      "{'user': 'tcampisi777', 'timestamp': 'Sun Mar 24 21:47:06 EET 2019', 'followers': []}\n",
      "{'user': 'MarciaJ91882912', 'timestamp': 'Sun Mar 24 21:47:19 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe', 'DiJohnson15']}\n",
      "{'user': 'MarciaJ91882912', 'timestamp': 'Sun Mar 24 21:47:58 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe', 'DiJohnson15']}\n",
      "{'user': 'oliverg2014', 'timestamp': 'Sun Mar 24 21:49:12 EET 2019', 'followers': ['mpgarza2012']}\n",
      "{'user': 'DiJohnson15', 'timestamp': 'Sun Mar 24 21:49:58 EET 2019', 'followers': ['mpgarza2012', 'loudthorpe', 'MarciaJ91882912']}\n",
      "{'user': 'barbara_kobrin', 'timestamp': 'Sun Mar 24 21:53:05 EET 2019', 'followers': []}\n",
      "{'user': 'TsalagiOK', 'timestamp': 'Sun Mar 24 21:54:14 EET 2019', 'followers': []}\n",
      "{'user': 'mccuebillie', 'timestamp': 'Sun Mar 24 21:54:45 EET 2019', 'followers': []}\n",
      "{'user': 'boydfrances33', 'timestamp': 'Sun Mar 24 21:55:18 EET 2019', 'followers': []}\n",
      "{'user': 'maggievoelker', 'timestamp': 'Sun Mar 24 22:07:07 EET 2019', 'followers': []}\n",
      "{'user': 'drewboughton', 'timestamp': 'Sun Mar 24 22:08:54 EET 2019', 'followers': []}\n",
      "{'user': 'ecorangerfairmo', 'timestamp': 'Sun Mar 24 22:11:39 EET 2019', 'followers': []}\n",
      "{'user': 'SassyGma6', 'timestamp': 'Sun Mar 24 22:19:12 EET 2019', 'followers': []}\n",
      "{'user': 'rosietime', 'timestamp': 'Sun Mar 24 22:20:09 EET 2019', 'followers': []}\n",
      "{'user': 'DougDooganuchi', 'timestamp': 'Sun Mar 24 22:34:36 EET 2019', 'followers': []}\n",
      "{'user': 'DougDooganuchi', 'timestamp': 'Sun Mar 24 22:35:18 EET 2019', 'followers': []}\n",
      "{'user': 'Numbers28', 'timestamp': 'Sun Mar 24 22:39:32 EET 2019', 'followers': ['supertaschablue', 'onahunttoday']}\n",
      "{'user': 'onahunttoday', 'timestamp': 'Sun Mar 24 22:39:51 EET 2019', 'followers': ['mpgarza2012', 'Numbers28', 'Backstorymom1']}\n",
      "{'user': 'FLGATOR20', 'timestamp': 'Sun Mar 24 22:39:55 EET 2019', 'followers': []}\n",
      "{'user': 'plazaro13', 'timestamp': 'Sun Mar 24 22:41:44 EET 2019', 'followers': []}\n",
      "{'user': 'BruceDBraden22', 'timestamp': 'Sun Mar 24 22:50:59 EET 2019', 'followers': []}\n",
      "{'user': 'MerleJennings18', 'timestamp': 'Sun Mar 24 22:55:19 EET 2019', 'followers': []}\n",
      "{'user': 'RAKWIS', 'timestamp': 'Sun Mar 24 23:01:20 EET 2019', 'followers': []}\n",
      "{'user': 'GeostompX', 'timestamp': 'Sun Mar 24 23:08:13 EET 2019', 'followers': []}\n",
      "{'user': 'RSmith1935', 'timestamp': 'Sun Mar 24 23:19:45 EET 2019', 'followers': []}\n",
      "{'user': 'jmisraje1111', 'timestamp': 'Sun Mar 24 23:28:42 EET 2019', 'followers': []}\n",
      "{'user': 'corvuss777', 'timestamp': 'Sun Mar 24 23:38:53 EET 2019', 'followers': []}\n",
      "{'user': 'Starwat96241874', 'timestamp': 'Sun Mar 24 23:43:28 EET 2019', 'followers': []}\n",
      "{'user': 'jruha', 'timestamp': 'Sun Mar 24 23:57:07 EET 2019', 'followers': []}\n",
      "{'user': 'parisfragrance', 'timestamp': 'Mon Mar 25 00:14:41 EET 2019', 'followers': []}\n",
      "{'user': 'parisfragrance', 'timestamp': 'Mon Mar 25 00:16:09 EET 2019', 'followers': []}\n",
      "{'user': 'danielbsmith', 'timestamp': 'Mon Mar 25 00:20:14 EET 2019', 'followers': []}\n",
      "{'user': 'JohnnyHeldt', 'timestamp': 'Mon Mar 25 00:46:41 EET 2019', 'followers': ['NetNewsBuzz']}\n",
      "{'user': 'robdel66', 'timestamp': 'Mon Mar 25 00:49:24 EET 2019', 'followers': []}\n",
      "{'user': 'TerrellDLewis', 'timestamp': 'Mon Mar 25 00:53:09 EET 2019', 'followers': ['Backstorymom1']}\n",
      "{'user': 'jimetoo', 'timestamp': 'Mon Mar 25 00:58:22 EET 2019', 'followers': []}\n",
      "{'user': 'JohnnyHeldt', 'timestamp': 'Mon Mar 25 00:59:23 EET 2019', 'followers': ['NetNewsBuzz']}\n",
      "{'user': 'Doug_Columbia', 'timestamp': 'Mon Mar 25 01:23:59 EET 2019', 'followers': []}\n",
      "{'user': 'Bellalindafox', 'timestamp': 'Mon Mar 25 01:26:00 EET 2019', 'followers': []}\n",
      "{'user': 'JohnnyHeldt', 'timestamp': 'Mon Mar 25 01:44:42 EET 2019', 'followers': ['NetNewsBuzz']}\n",
      "{'user': 'Backstorymom1', 'timestamp': 'Mon Mar 25 01:44:56 EET 2019', 'followers': ['supertaschablue']}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:52:21 EET 2019', 'followers': ['NetNewsBuzz']}\n",
      "{'user': 'Drez2018', 'timestamp': 'Mon Mar 25 02:11:14 EET 2019', 'followers': []}\n",
      "{'user': 'khorah', 'timestamp': 'Mon Mar 25 03:51:05 EET 2019', 'followers': []}\n",
      "{'user': 'pbh09', 'timestamp': 'Mon Mar 25 04:24:56 EET 2019', 'followers': []}\n",
      "{'user': 'darionavarro111', 'timestamp': 'Mon Mar 25 08:19:39 EET 2019', 'followers': ['supertaschablue', 'tcampisi777']}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 23:16:05 EET 2019', 'followers': ['DarrellWest1984', 'riceor', 'TawdryOtter', 'chesse47', 'PROGRESSIVELIBE', 'BillSech', 'scott_squires', 'mikeedw56668977', 'KOANDMIKA', 'BrendaL03778178', 'Edgutk', 'Arriadna', 'SaudiaPaige', 'HenryBLowery', 'CrazyBob48', 'pamelaricks', 'BjayukCat', 'KDavCor', 'gabe_aguilar03', 'mcp_pol', 'RSmith1935', 'asutherland553', 'silverthornn264', 'BrendaHazelhur1', 'cld1205', 'Elljay1011', 'JohnnyHeldt', 'jimetoo', 'MerleJennings18', 'TassajaraRd', 'arcturus300', 'cmpnwtr', 'rjber15', 'PoliticusSarah', 'mentorinca', 'CitizenWonk', 'Mleeds2048', 'PolitJunkieM', 'jruha', 'robertfranek', 'pjRN', '4030lisa', 'wininmad', 'GGranma', 'goshofar', 'RiverCruiseChic', 'ascalon5', 'uo_duck99']}\n",
      "{'user': 'DarrellWest1984', 'timestamp': 'Sun Mar 24 23:16:37 EET 2019', 'followers': []}\n",
      "{'user': 'riceor', 'timestamp': 'Sun Mar 24 23:18:08 EET 2019', 'followers': ['CitizenWonk']}\n",
      "{'user': 'TawdryOtter', 'timestamp': 'Sun Mar 24 23:18:16 EET 2019', 'followers': ['slim_mirokujin']}\n",
      "{'user': 'chesse47', 'timestamp': 'Sun Mar 24 23:18:19 EET 2019', 'followers': ['mchovden1785']}\n",
      "{'user': 'PROGRESSIVELIBE', 'timestamp': 'Sun Mar 24 23:19:11 EET 2019', 'followers': []}\n",
      "{'user': 'BillSech', 'timestamp': 'Sun Mar 24 23:19:44 EET 2019', 'followers': []}\n",
      "{'user': 'scott_squires', 'timestamp': 'Sun Mar 24 23:20:02 EET 2019', 'followers': []}\n",
      "{'user': 'mikeedw56668977', 'timestamp': 'Sun Mar 24 23:21:26 EET 2019', 'followers': ['Arriadna', 'CarrollynAragon', 'PolitJunkieM', 'uo_duck99']}\n",
      "{'user': 'KOANDMIKA', 'timestamp': 'Sun Mar 24 23:23:32 EET 2019', 'followers': []}\n",
      "{'user': 'BrendaL03778178', 'timestamp': 'Sun Mar 24 23:24:33 EET 2019', 'followers': ['Edgutk']}\n",
      "{'user': 'Edgutk', 'timestamp': 'Sun Mar 24 23:24:44 EET 2019', 'followers': ['BrendaL03778178', 'Arriadna', 'TsunamiNation', 'KDavCor']}\n",
      "{'user': 'Arriadna', 'timestamp': 'Sun Mar 24 23:25:13 EET 2019', 'followers': ['mikeedw56668977', 'BrendaL03778178', 'Edgutk', 'CarrollynAragon', 'Bunnwarmer', 'MerleJennings18', 'mentorinca', 'wewantpeace4all', 'uo_duck99']}\n",
      "{'user': 'SaudiaPaige', 'timestamp': 'Sun Mar 24 23:25:56 EET 2019', 'followers': []}\n",
      "{'user': 'HenryBLowery', 'timestamp': 'Sun Mar 24 23:26:35 EET 2019', 'followers': ['arcturus300', 'uo_duck99']}\n",
      "{'user': 'CarrollynAragon', 'timestamp': 'Sun Mar 24 23:27:50 EET 2019', 'followers': []}\n",
      "{'user': 'TsunamiNation', 'timestamp': 'Sun Mar 24 23:29:21 EET 2019', 'followers': ['HenryBLowery', 'CrazyBob48', 'rcrockett', 'KDavCor', 'mcp_pol', 'TassajaraRd', 'CitizenWonk', 'uo_duck99']}\n",
      "{'user': 'CrazyBob48', 'timestamp': 'Sun Mar 24 23:29:51 EET 2019', 'followers': ['TsunamiNation']}\n",
      "{'user': 'citybees', 'timestamp': 'Sun Mar 24 23:30:28 EET 2019', 'followers': []}\n",
      "{'user': 'rcrockett', 'timestamp': 'Sun Mar 24 23:30:38 EET 2019', 'followers': ['Bunnwarmer']}\n",
      "{'user': 'pamelaricks', 'timestamp': 'Sun Mar 24 23:34:35 EET 2019', 'followers': []}\n",
      "{'user': 'Bunnwarmer', 'timestamp': 'Sun Mar 24 23:36:12 EET 2019', 'followers': ['MerleJennings18', 'uo_duck99']}\n",
      "{'user': 'BjayukCat', 'timestamp': 'Sun Mar 24 23:36:16 EET 2019', 'followers': []}\n",
      "{'user': 'mchovden1785', 'timestamp': 'Sun Mar 24 23:38:13 EET 2019', 'followers': ['KristinAGroh2', 'RSmith1935', 'seagoddess2', 'TassajaraRd']}\n",
      "{'user': 'BjayukCat', 'timestamp': 'Sun Mar 24 23:40:38 EET 2019', 'followers': []}\n",
      "{'user': 'KDavCor', 'timestamp': 'Sun Mar 24 23:43:45 EET 2019', 'followers': ['CitizenWonk', '4030lisa', 'uo_duck99']}\n",
      "{'user': 'KristinAGroh2', 'timestamp': 'Sun Mar 24 23:44:29 EET 2019', 'followers': ['mchovden1785']}\n",
      "{'user': 'gabe_aguilar03', 'timestamp': 'Sun Mar 24 23:45:29 EET 2019', 'followers': []}\n",
      "{'user': 'mcp_pol', 'timestamp': 'Sun Mar 24 23:46:48 EET 2019', 'followers': ['arcturus300', 'PolitJunkieM', 'uo_duck99']}\n",
      "{'user': 'RSmith1935', 'timestamp': 'Sun Mar 24 23:46:51 EET 2019', 'followers': ['AngelMabel19761']}\n",
      "{'user': 'seagoddess2', 'timestamp': 'Sun Mar 24 23:47:17 EET 2019', 'followers': ['AngelMabel19761']}\n",
      "{'user': 'AngelMabel19761', 'timestamp': 'Sun Mar 24 23:48:59 EET 2019', 'followers': ['RSmith1935', 'seagoddess2', 'BrickwithanA']}\n",
      "{'user': 'BrickwithanA', 'timestamp': 'Sun Mar 24 23:50:07 EET 2019', 'followers': ['AngelMabel19761']}\n",
      "{'user': 'asutherland553', 'timestamp': 'Sun Mar 24 23:57:09 EET 2019', 'followers': []}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Mon Mar 25 00:03:45 EET 2019', 'followers': ['jimetoo']}\n",
      "{'user': 'BrendaHazelhur1', 'timestamp': 'Mon Mar 25 00:06:28 EET 2019', 'followers': ['RSmith1935']}\n",
      "{'user': 'cld1205', 'timestamp': 'Mon Mar 25 00:17:50 EET 2019', 'followers': ['cmpnwtr', 'PoliticusSarah', 'CitizenWonk', 'PolitJunkieM', 'HelpforBear', 'wininmad', 'GGranma', 'uo_duck99']}\n",
      "{'user': 'Elljay1011', 'timestamp': 'Mon Mar 25 00:21:51 EET 2019', 'followers': []}\n",
      "{'user': 'madneon', 'timestamp': 'Mon Mar 25 00:25:20 EET 2019', 'followers': []}\n",
      "{'user': 'JohnnyHeldt', 'timestamp': 'Mon Mar 25 00:53:42 EET 2019', 'followers': ['TassajaraRd']}\n",
      "{'user': 'jimetoo', 'timestamp': 'Mon Mar 25 00:57:05 EET 2019', 'followers': []}\n",
      "{'user': 'MerleJennings18', 'timestamp': 'Mon Mar 25 00:58:59 EET 2019', 'followers': ['Allegedly_G']}\n",
      "{'user': 'TassajaraRd', 'timestamp': 'Mon Mar 25 01:00:54 EET 2019', 'followers': ['JohnnyHeldt', 'MerleJennings18']}\n",
      "{'user': 'arcturus300', 'timestamp': 'Mon Mar 25 01:07:31 EET 2019', 'followers': ['uo_duck99']}\n",
      "{'user': 'cmpnwtr', 'timestamp': 'Mon Mar 25 01:14:45 EET 2019', 'followers': ['joboomr44']}\n",
      "{'user': 'rjber15', 'timestamp': 'Mon Mar 25 01:42:58 EET 2019', 'followers': []}\n",
      "{'user': 'PoliticusSarah', 'timestamp': 'Mon Mar 25 01:43:14 EET 2019', 'followers': ['MerleJennings18', 'govierbill', 'CitizenWonk', 'oldboy_74', 'Allegedly_G', 'Mleeds2048', 'KurtRexCooper', 'PolitJunkieM', 'Dovewoman1', 'OicOzzie', 'joboomr44', 'jruha', 'robertfranek', 'slim_mirokujin', 'pjRN', 'wininmad', 'GGranma', 'goshofar', 'Finn_Suomi', 'ydfished', 'uo_duck99']}\n",
      "{'user': 'govierbill', 'timestamp': 'Mon Mar 25 01:44:13 EET 2019', 'followers': []}\n",
      "{'user': 'mentorinca', 'timestamp': 'Mon Mar 25 01:44:27 EET 2019', 'followers': []}\n",
      "{'user': 'CitizenWonk', 'timestamp': 'Mon Mar 25 01:44:33 EET 2019', 'followers': ['PoliticusSarah', 'PolitJunkieM', 'Dovewoman1', 'robertfranek', 'wininmad', 'GGranma', 'uo_duck99']}\n",
      "{'user': 'oldboy_74', 'timestamp': 'Mon Mar 25 01:45:38 EET 2019', 'followers': []}\n",
      "{'user': 'Allegedly_G', 'timestamp': 'Mon Mar 25 01:46:11 EET 2019', 'followers': ['MerleJennings18']}\n",
      "{'user': 'Mleeds2048', 'timestamp': 'Mon Mar 25 01:47:15 EET 2019', 'followers': []}\n",
      "{'user': 'KurtRexCooper', 'timestamp': 'Mon Mar 25 01:50:09 EET 2019', 'followers': []}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:50:49 EET 2019', 'followers': ['4030lisa', 'GGranma']}\n",
      "{'user': 'Dovewoman1', 'timestamp': 'Mon Mar 25 01:51:00 EET 2019', 'followers': []}\n",
      "{'user': 'OicOzzie', 'timestamp': 'Mon Mar 25 01:53:20 EET 2019', 'followers': ['padakitty']}\n",
      "{'user': 'joboomr44', 'timestamp': 'Mon Mar 25 01:54:09 EET 2019', 'followers': []}\n",
      "{'user': 'jruha', 'timestamp': 'Mon Mar 25 01:55:13 EET 2019', 'followers': ['wininmad']}\n",
      "{'user': 'robertfranek', 'timestamp': 'Mon Mar 25 01:58:25 EET 2019', 'followers': []}\n",
      "{'user': 'slim_mirokujin', 'timestamp': 'Mon Mar 25 01:59:48 EET 2019', 'followers': []}\n",
      "{'user': 'pjRN', 'timestamp': 'Mon Mar 25 01:59:56 EET 2019', 'followers': []}\n",
      "{'user': 'HelpforBear', 'timestamp': 'Mon Mar 25 02:02:05 EET 2019', 'followers': ['uo_duck99']}\n",
      "{'user': '4030lisa', 'timestamp': 'Mon Mar 25 02:03:25 EET 2019', 'followers': ['PolitJunkieM']}\n",
      "{'user': 'wininmad', 'timestamp': 'Mon Mar 25 02:11:32 EET 2019', 'followers': ['jruha', 'hempaz']}\n",
      "{'user': 'GGranma', 'timestamp': 'Mon Mar 25 02:26:17 EET 2019', 'followers': ['PolitJunkieM', '4030lisa', 'goshofar', 'wewantpeace4all']}\n",
      "{'user': 'goshofar', 'timestamp': 'Mon Mar 25 02:27:58 EET 2019', 'followers': []}\n",
      "{'user': 'hempaz', 'timestamp': 'Mon Mar 25 02:29:45 EET 2019', 'followers': []}\n",
      "{'user': 'wewantpeace4all', 'timestamp': 'Mon Mar 25 02:36:33 EET 2019', 'followers': []}\n",
      "{'user': 'Finn_Suomi', 'timestamp': 'Mon Mar 25 02:37:52 EET 2019', 'followers': []}\n",
      "{'user': 'RiverCruiseChic', 'timestamp': 'Mon Mar 25 02:51:11 EET 2019', 'followers': []}\n",
      "{'user': 'ydfished', 'timestamp': 'Mon Mar 25 04:13:01 EET 2019', 'followers': []}\n",
      "{'user': 'padakitty', 'timestamp': 'Mon Mar 25 04:22:36 EET 2019', 'followers': []}\n",
      "{'user': 'ascalon5', 'timestamp': 'Mon Mar 25 05:26:28 EET 2019', 'followers': []}\n",
      "{'user': 'uo_duck99', 'timestamp': 'Mon Mar 25 07:13:50 EET 2019', 'followers': []}\n",
      "{'user': 'TNKABTIT', 'timestamp': 'Mon Mar 25 07:42:50 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 22:11:56 EET 2019', 'followers': ['AWorldOutOfMind', 'Lisa_Iannucci', 'POSUTtRUmp', 'BrendaL03778178', 'TrumpNewsDump', 'cosmicfirepeace', 'ConnieInAmerica', 'NikitaKitty', 'RobertMouton4', '27Seascapes', 'cmpnwtr', 'CliveLive2', 'NetNewsBuzz', 'kdv10s', 'syringa11', 'souzi54', 'rjber15', 'silverthornn264', 'evaleegifford11', 'princessearl1st', 'PolitJunkieM']}\n",
      "{'user': 'AWorldOutOfMind', 'timestamp': 'Sun Mar 24 22:13:02 EET 2019', 'followers': []}\n",
      "{'user': 'Lisa_Iannucci', 'timestamp': 'Sun Mar 24 22:13:08 EET 2019', 'followers': []}\n",
      "{'user': 'POSUTtRUmp', 'timestamp': 'Sun Mar 24 22:13:37 EET 2019', 'followers': []}\n",
      "{'user': 'Annealeeb', 'timestamp': 'Sun Mar 24 22:14:44 EET 2019', 'followers': []}\n",
      "{'user': 'BrendaL03778178', 'timestamp': 'Sun Mar 24 22:15:03 EET 2019', 'followers': []}\n",
      "{'user': 'TrumpNewsDump', 'timestamp': 'Sun Mar 24 22:16:24 EET 2019', 'followers': []}\n",
      "{'user': 'cosmicfirepeace', 'timestamp': 'Sun Mar 24 22:18:30 EET 2019', 'followers': []}\n",
      "{'user': 'ConnieInAmerica', 'timestamp': 'Sun Mar 24 22:25:06 EET 2019', 'followers': []}\n",
      "{'user': 'NikitaKitty', 'timestamp': 'Sun Mar 24 22:25:18 EET 2019', 'followers': ['cosmicfirepeace', 'copperbird7']}\n",
      "{'user': 'RobertMouton4', 'timestamp': 'Sun Mar 24 22:25:59 EET 2019', 'followers': []}\n",
      "{'user': 'copperbird7', 'timestamp': 'Sun Mar 24 22:28:06 EET 2019', 'followers': ['NikitaKitty']}\n",
      "{'user': 'adam46838515', 'timestamp': 'Sun Mar 24 22:28:43 EET 2019', 'followers': []}\n",
      "{'user': '27Seascapes', 'timestamp': 'Sun Mar 24 22:28:50 EET 2019', 'followers': []}\n",
      "{'user': 'cmpnwtr', 'timestamp': 'Sun Mar 24 22:29:10 EET 2019', 'followers': []}\n",
      "{'user': 'CliveLive2', 'timestamp': 'Sun Mar 24 22:30:05 EET 2019', 'followers': []}\n",
      "{'user': 'NetNewsBuzz', 'timestamp': 'Sun Mar 24 22:35:02 EET 2019', 'followers': ['Cattra922', 'onecaliberal', 'PolitJunkieM']}\n",
      "{'user': 'kdv10s', 'timestamp': 'Sun Mar 24 22:37:00 EET 2019', 'followers': []}\n",
      "{'user': 'syringa11', 'timestamp': 'Sun Mar 24 22:37:01 EET 2019', 'followers': []}\n",
      "{'user': 'Cattra922', 'timestamp': 'Sun Mar 24 22:39:08 EET 2019', 'followers': ['NetNewsBuzz', 'onecaliberal', 'PolitJunkieM']}\n",
      "{'user': 'souzi54', 'timestamp': 'Sun Mar 24 22:39:14 EET 2019', 'followers': []}\n",
      "{'user': 'yellingtree1', 'timestamp': 'Sun Mar 24 22:40:10 EET 2019', 'followers': []}\n",
      "{'user': 'RoWithit', 'timestamp': 'Sun Mar 24 22:47:05 EET 2019', 'followers': []}\n",
      "{'user': 'TheSusieQue', 'timestamp': 'Sun Mar 24 22:57:42 EET 2019', 'followers': []}\n",
      "{'user': 'rjber15', 'timestamp': 'Sun Mar 24 23:01:51 EET 2019', 'followers': []}\n",
      "{'user': 'adam46838515', 'timestamp': 'Sun Mar 24 23:03:17 EET 2019', 'followers': []}\n",
      "{'user': 'GeostompX', 'timestamp': 'Sun Mar 24 23:07:59 EET 2019', 'followers': []}\n",
      "{'user': 'QueenMSheba', 'timestamp': 'Sun Mar 24 23:19:09 EET 2019', 'followers': []}\n",
      "{'user': 'michaelj121173', 'timestamp': 'Sun Mar 24 23:49:44 EET 2019', 'followers': []}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Mon Mar 25 00:04:22 EET 2019', 'followers': []}\n",
      "{'user': 'tari1231', 'timestamp': 'Mon Mar 25 00:10:38 EET 2019', 'followers': []}\n",
      "{'user': 'evaleegifford11', 'timestamp': 'Mon Mar 25 00:19:23 EET 2019', 'followers': []}\n",
      "{'user': 'onecaliberal', 'timestamp': 'Mon Mar 25 00:38:50 EET 2019', 'followers': []}\n",
      "{'user': 'JamesTLockhart', 'timestamp': 'Mon Mar 25 00:50:34 EET 2019', 'followers': []}\n",
      "{'user': 'princessearl1st', 'timestamp': 'Mon Mar 25 00:53:52 EET 2019', 'followers': []}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:51:12 EET 2019', 'followers': ['NetNewsBuzz', 'Cattra922', 'onecaliberal']}\n",
      "{'user': 'ivangut85755723', 'timestamp': 'Mon Mar 25 01:57:49 EET 2019', 'followers': []}\n",
      "{'user': 'Sophie281032116', 'timestamp': 'Mon Mar 25 03:26:12 EET 2019', 'followers': []}\n",
      "{'user': 'TheOnion', 'timestamp': 'Mon Mar 25 02:12:02 EET 2019', 'followers': []}\n",
      "{'user': 'krankorwat', 'timestamp': 'Mon Mar 25 02:12:30 EET 2019', 'followers': []}\n",
      "{'user': 'ParaInTheWorld', 'timestamp': 'Mon Mar 25 02:12:31 EET 2019', 'followers': []}\n",
      "{'user': 'NormalCaptain', 'timestamp': 'Mon Mar 25 02:12:55 EET 2019', 'followers': []}\n",
      "{'user': 'Linsley71', 'timestamp': 'Mon Mar 25 02:13:07 EET 2019', 'followers': ['22dropbear']}\n",
      "{'user': 'bl4cklodge', 'timestamp': 'Mon Mar 25 02:13:15 EET 2019', 'followers': []}\n",
      "{'user': 'EndConJobs', 'timestamp': 'Mon Mar 25 02:13:18 EET 2019', 'followers': []}\n",
      "{'user': 'BradIey98', 'timestamp': 'Mon Mar 25 02:13:21 EET 2019', 'followers': []}\n",
      "{'user': 'JakeNelsonMN', 'timestamp': 'Mon Mar 25 02:13:25 EET 2019', 'followers': []}\n",
      "{'user': 'stuffandplayx', 'timestamp': 'Mon Mar 25 02:13:30 EET 2019', 'followers': []}\n",
      "{'user': 'EndConJobs', 'timestamp': 'Mon Mar 25 02:13:39 EET 2019', 'followers': []}\n",
      "{'user': 'ForTheBananna', 'timestamp': 'Mon Mar 25 02:13:40 EET 2019', 'followers': []}\n",
      "{'user': 'cocobutterzs', 'timestamp': 'Mon Mar 25 02:13:51 EET 2019', 'followers': []}\n",
      "{'user': 'soulonthaw', 'timestamp': 'Mon Mar 25 02:13:53 EET 2019', 'followers': []}\n",
      "{'user': 'Just_saiyan99', 'timestamp': 'Mon Mar 25 02:13:54 EET 2019', 'followers': []}\n",
      "{'user': 'physifish', 'timestamp': 'Mon Mar 25 02:13:56 EET 2019', 'followers': []}\n",
      "{'user': 'fj_newman', 'timestamp': 'Mon Mar 25 02:14:03 EET 2019', 'followers': []}\n",
      "{'user': 'authorclondon', 'timestamp': 'Mon Mar 25 02:14:09 EET 2019', 'followers': []}\n",
      "{'user': 'clmerle', 'timestamp': 'Mon Mar 25 02:14:13 EET 2019', 'followers': []}\n",
      "{'user': 'beccthewreck', 'timestamp': 'Mon Mar 25 02:14:15 EET 2019', 'followers': []}\n",
      "{'user': 'Hendyhendel', 'timestamp': 'Mon Mar 25 02:14:17 EET 2019', 'followers': []}\n",
      "{'user': 'physifish', 'timestamp': 'Mon Mar 25 02:14:17 EET 2019', 'followers': []}\n",
      "{'user': 'catbro69', 'timestamp': 'Mon Mar 25 02:14:25 EET 2019', 'followers': []}\n",
      "{'user': 'BronxLaugher', 'timestamp': 'Mon Mar 25 02:14:36 EET 2019', 'followers': []}\n",
      "{'user': 'lowellbellew', 'timestamp': 'Mon Mar 25 02:14:37 EET 2019', 'followers': []}\n",
      "{'user': 'BillBraski5', 'timestamp': 'Mon Mar 25 02:14:40 EET 2019', 'followers': []}\n",
      "{'user': 'ninjyte', 'timestamp': 'Mon Mar 25 02:14:45 EET 2019', 'followers': []}\n",
      "{'user': 'theghostcaptain', 'timestamp': 'Mon Mar 25 02:15:02 EET 2019', 'followers': []}\n",
      "{'user': 'arclight', 'timestamp': 'Mon Mar 25 02:15:09 EET 2019', 'followers': []}\n",
      "{'user': 'writerlike1', 'timestamp': 'Mon Mar 25 02:15:09 EET 2019', 'followers': ['absrdNEWS']}\n",
      "{'user': 'writerlike1', 'timestamp': 'Mon Mar 25 02:15:16 EET 2019', 'followers': ['absrdNEWS']}\n",
      "{'user': 'wegthor', 'timestamp': 'Mon Mar 25 02:15:19 EET 2019', 'followers': []}\n",
      "{'user': 'JorgFeldstein', 'timestamp': 'Mon Mar 25 02:15:23 EET 2019', 'followers': []}\n",
      "{'user': 'TalkwardPodcast', 'timestamp': 'Mon Mar 25 02:15:30 EET 2019', 'followers': ['TonyWHmag']}\n",
      "{'user': 'Mizener', 'timestamp': 'Mon Mar 25 02:15:50 EET 2019', 'followers': []}\n",
      "{'user': 'VeryIsom', 'timestamp': 'Mon Mar 25 02:15:52 EET 2019', 'followers': []}\n",
      "{'user': 'getoutamyway', 'timestamp': 'Mon Mar 25 02:16:11 EET 2019', 'followers': []}\n",
      "{'user': 'WolfeReports', 'timestamp': 'Mon Mar 25 02:17:55 EET 2019', 'followers': []}\n",
      "{'user': 'absrdNEWS', 'timestamp': 'Mon Mar 25 02:18:05 EET 2019', 'followers': ['writerlike1', 'TalkwardPodcast']}\n",
      "{'user': 'SunScot', 'timestamp': 'Mon Mar 25 02:18:15 EET 2019', 'followers': []}\n",
      "{'user': 'hiltonhebb', 'timestamp': 'Mon Mar 25 02:18:17 EET 2019', 'followers': []}\n",
      "{'user': 'GustavoArellano', 'timestamp': 'Mon Mar 25 02:18:18 EET 2019', 'followers': []}\n",
      "{'user': 'ExtraRubinesque', 'timestamp': 'Mon Mar 25 02:19:20 EET 2019', 'followers': []}\n",
      "{'user': 'JuanBarona5', 'timestamp': 'Mon Mar 25 02:19:27 EET 2019', 'followers': []}\n",
      "{'user': 'TonyWHmag', 'timestamp': 'Mon Mar 25 02:20:27 EET 2019', 'followers': []}\n",
      "{'user': 'worf_tour', 'timestamp': 'Mon Mar 25 02:20:40 EET 2019', 'followers': []}\n",
      "{'user': 'GreigAmes', 'timestamp': 'Mon Mar 25 02:21:16 EET 2019', 'followers': []}\n",
      "{'user': 'CERUWOLF', 'timestamp': 'Mon Mar 25 02:21:21 EET 2019', 'followers': []}\n",
      "{'user': 'mrbigg450', 'timestamp': 'Mon Mar 25 02:21:28 EET 2019', 'followers': []}\n",
      "{'user': 'ChloeMS', 'timestamp': 'Mon Mar 25 02:21:51 EET 2019', 'followers': []}\n",
      "{'user': 'MusingsOfDeimos', 'timestamp': 'Mon Mar 25 02:22:30 EET 2019', 'followers': []}\n",
      "{'user': 'mikeissalty', 'timestamp': 'Mon Mar 25 02:23:23 EET 2019', 'followers': []}\n",
      "{'user': 'realJDRico', 'timestamp': 'Mon Mar 25 02:23:27 EET 2019', 'followers': []}\n",
      "{'user': 'TheFamedClock', 'timestamp': 'Mon Mar 25 02:23:54 EET 2019', 'followers': []}\n",
      "{'user': 'Faux_Schlmoe', 'timestamp': 'Mon Mar 25 02:25:05 EET 2019', 'followers': []}\n",
      "{'user': 'Deckerbot', 'timestamp': 'Mon Mar 25 02:26:06 EET 2019', 'followers': []}\n",
      "{'user': 'jlespejo72', 'timestamp': 'Mon Mar 25 02:27:05 EET 2019', 'followers': []}\n",
      "{'user': 'moochie222', 'timestamp': 'Mon Mar 25 02:29:10 EET 2019', 'followers': []}\n",
      "{'user': 'SaraCarriveau', 'timestamp': 'Mon Mar 25 02:31:25 EET 2019', 'followers': []}\n",
      "{'user': 'hagler_matt', 'timestamp': 'Mon Mar 25 02:33:50 EET 2019', 'followers': []}\n",
      "{'user': 'ajitnewyork', 'timestamp': 'Mon Mar 25 02:35:33 EET 2019', 'followers': []}\n",
      "{'user': 'alexgorelick', 'timestamp': 'Mon Mar 25 02:35:58 EET 2019', 'followers': []}\n",
      "{'user': '22dropbear', 'timestamp': 'Mon Mar 25 02:39:33 EET 2019', 'followers': []}\n",
      "{'user': 'UpdikeChandler', 'timestamp': 'Mon Mar 25 02:40:25 EET 2019', 'followers': []}\n",
      "{'user': 'danpallotta', 'timestamp': 'Mon Mar 25 02:40:32 EET 2019', 'followers': []}\n",
      "{'user': 'evansotelo', 'timestamp': 'Mon Mar 25 02:44:02 EET 2019', 'followers': []}\n",
      "{'user': 'TweetofAzrael', 'timestamp': 'Mon Mar 25 02:46:56 EET 2019', 'followers': []}\n",
      "{'user': 'CMac91', 'timestamp': 'Mon Mar 25 03:00:10 EET 2019', 'followers': []}\n",
      "{'user': 'damontwits', 'timestamp': 'Mon Mar 25 03:01:13 EET 2019', 'followers': []}\n",
      "{'user': 'ZachJeff__', 'timestamp': 'Mon Mar 25 03:05:21 EET 2019', 'followers': []}\n",
      "{'user': 'lostNoParty', 'timestamp': 'Mon Mar 25 03:08:39 EET 2019', 'followers': []}\n",
      "{'user': 'JoeGagsy', 'timestamp': 'Mon Mar 25 03:08:41 EET 2019', 'followers': []}\n",
      "{'user': 'ryankime', 'timestamp': 'Mon Mar 25 03:09:41 EET 2019', 'followers': []}\n",
      "{'user': 'thoole', 'timestamp': 'Mon Mar 25 03:24:36 EET 2019', 'followers': []}\n",
      "{'user': 'MarcusH23386569', 'timestamp': 'Mon Mar 25 03:58:27 EET 2019', 'followers': []}\n",
      "{'user': 'akirarequiem', 'timestamp': 'Mon Mar 25 04:02:08 EET 2019', 'followers': []}\n",
      "{'user': 'gloop7272', 'timestamp': 'Mon Mar 25 04:07:37 EET 2019', 'followers': []}\n",
      "{'user': 'FloofyMasky', 'timestamp': 'Mon Mar 25 04:27:25 EET 2019', 'followers': []}\n",
      "{'user': 'AlexPreiss4', 'timestamp': 'Mon Mar 25 04:45:15 EET 2019', 'followers': []}\n",
      "{'user': 'CRA_55', 'timestamp': 'Mon Mar 25 04:45:59 EET 2019', 'followers': []}\n",
      "{'user': '99999BEES', 'timestamp': 'Mon Mar 25 04:57:23 EET 2019', 'followers': []}\n",
      "{'user': 'SS2Jet', 'timestamp': 'Mon Mar 25 05:01:34 EET 2019', 'followers': []}\n",
      "{'user': 'CreeBagley', 'timestamp': 'Mon Mar 25 05:04:53 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': '21WIRE', 'timestamp': 'Sun Mar 24 12:19:32 EET 2019', 'followers': ['e1af38f6dbad458', 'MurraySchwann', 'GeromanAT', 'kungfu_mandarin', 'hairymarx1', 'tngadd', 'wootendw', 'surfcityphoto', 'slink_E', 'IdonAkarnan', 'Beskooo', 'Mighty_Humanzee', 'Marwa__Osman', 'Sorgfelt', 'joaonunes67', 'ecocentrism1', 'kayalisalim', 'JohnMHenni2', 'squeeth', 'maurlind', 'Christi196155', 'Starsailoresss', 'dhillos318', 'JaredThreepoint', 'babstar', 'Meadows_Marin', 'HiwattPete', 'Souria4Syrians', 'freedomgirl2011', 'corruptbritain', 'petros_berhe', 'peter_donnelly', 'GrinchyPJ', 'aboutreed', 'dvernychuk', 'timesofiraq', 'MrLJones2', 'Jennife11439803', 'PhilipM67375789', 'gengh60', 'Alobhin', 'peterpobjecky', 'kazuma893', 'theaceofbass']}\n",
      "{'user': 'e1af38f6dbad458', 'timestamp': 'Sun Mar 24 12:20:03 EET 2019', 'followers': ['Marwa__Osman']}\n",
      "{'user': 'MurraySchwann', 'timestamp': 'Sun Mar 24 12:20:27 EET 2019', 'followers': []}\n",
      "{'user': 'GeromanAT', 'timestamp': 'Sun Mar 24 12:21:09 EET 2019', 'followers': ['hairymarx1', 'moderate_sander', 'freedomgirl2011', 'PhilipM67375789', 'gengh60', 'peterpobjecky']}\n",
      "{'user': 'kungfu_mandarin', 'timestamp': 'Sun Mar 24 12:22:41 EET 2019', 'followers': ['Starsailoresss', 'GrinchyPJ']}\n",
      "{'user': 'hairymarx1', 'timestamp': 'Sun Mar 24 12:26:12 EET 2019', 'followers': ['PhilipM67375789', 'Alobhin', 'peterpobjecky']}\n",
      "{'user': 'tngadd', 'timestamp': 'Sun Mar 24 12:26:51 EET 2019', 'followers': []}\n",
      "{'user': 'wootendw', 'timestamp': 'Sun Mar 24 12:30:43 EET 2019', 'followers': []}\n",
      "{'user': 'surfcityphoto', 'timestamp': 'Sun Mar 24 12:34:12 EET 2019', 'followers': []}\n",
      "{'user': 'slink_E', 'timestamp': 'Sun Mar 24 12:37:35 EET 2019', 'followers': []}\n",
      "{'user': 'Leo_Iratus', 'timestamp': 'Sun Mar 24 12:50:24 EET 2019', 'followers': ['hairymarx1', 'freedomgirl2011']}\n",
      "{'user': 'PietroDelPrete7', 'timestamp': 'Sun Mar 24 12:52:12 EET 2019', 'followers': ['peterpobjecky']}\n",
      "{'user': 'IdonAkarnan', 'timestamp': 'Sun Mar 24 13:14:42 EET 2019', 'followers': []}\n",
      "{'user': 'Beskooo', 'timestamp': 'Sun Mar 24 13:20:28 EET 2019', 'followers': []}\n",
      "{'user': 'Mighty_Humanzee', 'timestamp': 'Sun Mar 24 13:25:03 EET 2019', 'followers': []}\n",
      "{'user': 'birdtrees', 'timestamp': 'Sun Mar 24 13:36:49 EET 2019', 'followers': []}\n",
      "{'user': 'Marwa__Osman', 'timestamp': 'Sun Mar 24 13:44:25 EET 2019', 'followers': ['GeromanAT', 'hairymarx1', 'imeesamz', 'PhilipM67375789', 'gengh60', 'Alobhin', 'peterpobjecky', 'theaceofbass']}\n",
      "{'user': 'Sorgfelt', 'timestamp': 'Sun Mar 24 13:55:25 EET 2019', 'followers': []}\n",
      "{'user': 'joaonunes67', 'timestamp': 'Sun Mar 24 13:55:58 EET 2019', 'followers': []}\n",
      "{'user': 'ecocentrism1', 'timestamp': 'Sun Mar 24 13:59:52 EET 2019', 'followers': []}\n",
      "{'user': 'kayalisalim', 'timestamp': 'Sun Mar 24 14:07:47 EET 2019', 'followers': []}\n",
      "{'user': 'moderate_sander', 'timestamp': 'Sun Mar 24 14:08:15 EET 2019', 'followers': ['GeromanAT']}\n",
      "{'user': 'JohnMHenni2', 'timestamp': 'Sun Mar 24 14:10:43 EET 2019', 'followers': []}\n",
      "{'user': 'squeeth', 'timestamp': 'Sun Mar 24 14:18:11 EET 2019', 'followers': []}\n",
      "{'user': 'maurlind', 'timestamp': 'Sun Mar 24 14:27:39 EET 2019', 'followers': ['hairymarx1', 'LizzyM_TO', 'Alobhin']}\n",
      "{'user': 'LizzyM_TO', 'timestamp': 'Sun Mar 24 14:29:20 EET 2019', 'followers': ['maurlind']}\n",
      "{'user': 'Christi196155', 'timestamp': 'Sun Mar 24 14:29:26 EET 2019', 'followers': []}\n",
      "{'user': 'Starsailoresss', 'timestamp': 'Sun Mar 24 14:33:17 EET 2019', 'followers': ['peterpobjecky']}\n",
      "{'user': 'dhillos318', 'timestamp': 'Sun Mar 24 14:52:38 EET 2019', 'followers': []}\n",
      "{'user': 'JaredThreepoint', 'timestamp': 'Sun Mar 24 15:05:18 EET 2019', 'followers': []}\n",
      "{'user': 'babstar', 'timestamp': 'Sun Mar 24 15:07:42 EET 2019', 'followers': ['Marwa__Osman']}\n",
      "{'user': 'b74_carl', 'timestamp': 'Sun Mar 24 15:10:29 EET 2019', 'followers': []}\n",
      "{'user': 'b74_carl', 'timestamp': 'Sun Mar 24 15:10:55 EET 2019', 'followers': []}\n",
      "{'user': 'Meadows_Marin', 'timestamp': 'Sun Mar 24 15:23:12 EET 2019', 'followers': ['dragondeau52']}\n",
      "{'user': 'HiwattPete', 'timestamp': 'Sun Mar 24 15:34:14 EET 2019', 'followers': []}\n",
      "{'user': 'Souria4Syrians', 'timestamp': 'Sun Mar 24 15:43:57 EET 2019', 'followers': ['GeromanAT', 'hairymarx1', 'Marwa__Osman', 'ecocentrism1', 'moderate_sander', 'Christi196155', 'Starsailoresss', 'JaredThreepoint', 'babstar', 'RAF2attac', 'GreatPoppo', 'freedomgirl2011', 'Whoossain49th', 'QUEREMISTA', 'ShathifAli', 'AhmedAbouameni', 'GrinchyPJ', 'Plagiste4you', 'dvernychuk', 'imeesamz', 'ma000111', 'PhilipM67375789', 'JohnPetersAtty', 'gengh60', 'peterpobjecky', 'Hashimgrad']}\n",
      "{'user': 'RAF2attac', 'timestamp': 'Sun Mar 24 15:44:23 EET 2019', 'followers': ['bandee_de']}\n",
      "{'user': 'GreatPoppo', 'timestamp': 'Sun Mar 24 15:45:27 EET 2019', 'followers': ['iruka3', 'tooling20']}\n",
      "{'user': 'freedomgirl2011', 'timestamp': 'Sun Mar 24 15:47:46 EET 2019', 'followers': ['pearson4lz']}\n",
      "{'user': 'Whoossain49th', 'timestamp': 'Sun Mar 24 15:49:07 EET 2019', 'followers': ['Souria4Syrians', 'peterpobjecky']}\n",
      "{'user': 'iruka3', 'timestamp': 'Sun Mar 24 15:49:09 EET 2019', 'followers': []}\n",
      "{'user': 'QUEREMISTA', 'timestamp': 'Sun Mar 24 15:50:57 EET 2019', 'followers': []}\n",
      "{'user': 'corruptbritain', 'timestamp': 'Sun Mar 24 15:57:05 EET 2019', 'followers': ['hairymarx1', 'Alobhin']}\n",
      "{'user': 'ShathifAli', 'timestamp': 'Sun Mar 24 16:02:37 EET 2019', 'followers': []}\n",
      "{'user': 'bandee_de', 'timestamp': 'Sun Mar 24 16:03:15 EET 2019', 'followers': ['RAF2attac']}\n",
      "{'user': 'bandee_de', 'timestamp': 'Sun Mar 24 16:03:18 EET 2019', 'followers': ['RAF2attac']}\n",
      "{'user': 'petros_berhe', 'timestamp': 'Sun Mar 24 16:13:22 EET 2019', 'followers': []}\n",
      "{'user': 'AhmedAbouameni', 'timestamp': 'Sun Mar 24 16:15:17 EET 2019', 'followers': []}\n",
      "{'user': 'peter_donnelly', 'timestamp': 'Sun Mar 24 16:24:19 EET 2019', 'followers': []}\n",
      "{'user': 'GrinchyPJ', 'timestamp': 'Sun Mar 24 16:44:56 EET 2019', 'followers': ['birdtrees', 'Starsailoresss', 'peterpobjecky']}\n",
      "{'user': 'Plagiste4you', 'timestamp': 'Sun Mar 24 16:56:13 EET 2019', 'followers': []}\n",
      "{'user': 'aboutreed', 'timestamp': 'Sun Mar 24 17:37:17 EET 2019', 'followers': []}\n",
      "{'user': 'dvernychuk', 'timestamp': 'Sun Mar 24 17:41:23 EET 2019', 'followers': ['GeromanAT']}\n",
      "{'user': 'timesofiraq', 'timestamp': 'Sun Mar 24 18:35:32 EET 2019', 'followers': ['GrinchyPJ']}\n",
      "{'user': 'imeesamz', 'timestamp': 'Sun Mar 24 18:39:10 EET 2019', 'followers': []}\n",
      "{'user': 'Mithra301', 'timestamp': 'Sun Mar 24 19:15:09 EET 2019', 'followers': []}\n",
      "{'user': 'MrLJones2', 'timestamp': 'Sun Mar 24 19:35:06 EET 2019', 'followers': []}\n",
      "{'user': 'Jennife11439803', 'timestamp': 'Sun Mar 24 19:53:29 EET 2019', 'followers': []}\n",
      "{'user': 'ma000111', 'timestamp': 'Sun Mar 24 21:26:36 EET 2019', 'followers': ['freedomgirl2011', 'PhilipM67375789', 'Alobhin']}\n",
      "{'user': 'PhilipM67375789', 'timestamp': 'Sun Mar 24 21:28:20 EET 2019', 'followers': []}\n",
      "{'user': 'dragondeau52', 'timestamp': 'Sun Mar 24 21:55:04 EET 2019', 'followers': []}\n",
      "{'user': 'dolphinbay11', 'timestamp': 'Sun Mar 24 21:57:16 EET 2019', 'followers': ['dragondeau52']}\n",
      "{'user': 'JohnPetersAtty', 'timestamp': 'Sun Mar 24 21:59:02 EET 2019', 'followers': []}\n",
      "{'user': 'gengh60', 'timestamp': 'Sun Mar 24 22:19:56 EET 2019', 'followers': []}\n",
      "{'user': 'Alobhin', 'timestamp': 'Sun Mar 24 22:20:16 EET 2019', 'followers': []}\n",
      "{'user': 'tooling20', 'timestamp': 'Sun Mar 24 22:36:52 EET 2019', 'followers': []}\n",
      "{'user': 'peterpobjecky', 'timestamp': 'Mon Mar 25 00:15:48 EET 2019', 'followers': []}\n",
      "{'user': 'Hashimgrad', 'timestamp': 'Mon Mar 25 00:23:29 EET 2019', 'followers': []}\n",
      "{'user': 'pearson4lz', 'timestamp': 'Mon Mar 25 00:43:56 EET 2019', 'followers': []}\n",
      "{'user': 'kazuma893', 'timestamp': 'Mon Mar 25 00:46:20 EET 2019', 'followers': []}\n",
      "{'user': 'kazuma893', 'timestamp': 'Mon Mar 25 00:46:30 EET 2019', 'followers': []}\n",
      "{'user': 'theaceofbass', 'timestamp': 'Mon Mar 25 02:45:43 EET 2019', 'followers': []}\n",
      "{'user': 'AllFreedomfor', 'timestamp': 'Mon Mar 25 06:56:16 EET 2019', 'followers': []}\n",
      "{'user': 'aliimortada', 'timestamp': 'Mon Mar 25 08:45:40 EET 2019', 'followers': ['Marwa__Osman']}\n",
      "{'user': 'what_the_fysics', 'timestamp': 'Mon Mar 25 08:50:18 EET 2019', 'followers': []}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'user': 'politicususa', 'timestamp': 'Sun Mar 24 17:46:53 EET 2019', 'followers': ['erinbaby', 'MiamiNice57', 'silverthornn264', 'MarianMme16513', 'WhobbaBobba', 'Hattonsu', 'vinkoview', 'Mr_Scorpio', 'Bgolden53', 'MSMABAILEY', 'AwakenWholeness', 'maxthecat2000', 'MaryC_mlc4123', 'laleumen', 'syringa11', 'PolitiSmoose672', 'wininmad', 'evaleegifford11', 'genezog7', '7dnetwork', 'princessearl1st', 'LvnCali', 'mcp_pol', 'santo_aol', 'RBRB1516', 'maggievoelker', 'DianaSc99717236', 'Planelady1', 'StockScout1', 'FrenchieCat', 'wil91116385', 'gaelbill', 'chatta_girl', 'JohnnyHeldt', 'PolitJunkieM', 'cornerboy102000', 'purr10', 'barbara_kobrin', 'gramophoneman', 'Longley321']}\n",
      "{'user': 'erinbaby', 'timestamp': 'Sun Mar 24 17:47:20 EET 2019', 'followers': []}\n",
      "{'user': 'MiamiNice57', 'timestamp': 'Sun Mar 24 17:47:25 EET 2019', 'followers': ['sean_prevost']}\n",
      "{'user': 'silverthornn264', 'timestamp': 'Sun Mar 24 17:48:18 EET 2019', 'followers': []}\n",
      "{'user': 'MarianMme16513', 'timestamp': 'Sun Mar 24 17:49:19 EET 2019', 'followers': []}\n",
      "{'user': 'WhobbaBobba', 'timestamp': 'Sun Mar 24 17:49:21 EET 2019', 'followers': []}\n",
      "{'user': 'Hattonsu', 'timestamp': 'Sun Mar 24 17:49:45 EET 2019', 'followers': []}\n",
      "{'user': 'vinkoview', 'timestamp': 'Sun Mar 24 17:49:50 EET 2019', 'followers': []}\n",
      "{'user': 'Mr_Scorpio', 'timestamp': 'Sun Mar 24 17:51:50 EET 2019', 'followers': ['StockScout1', 'FrenchieCat']}\n",
      "{'user': 'violetcloudskye', 'timestamp': 'Sun Mar 24 17:52:04 EET 2019', 'followers': []}\n",
      "{'user': 'Bgolden53', 'timestamp': 'Sun Mar 24 17:52:06 EET 2019', 'followers': []}\n",
      "{'user': 'sean_prevost', 'timestamp': 'Sun Mar 24 17:52:45 EET 2019', 'followers': ['MiamiNice57']}\n",
      "{'user': 'MSMABAILEY', 'timestamp': 'Sun Mar 24 17:54:05 EET 2019', 'followers': []}\n",
      "{'user': 'AwakenWholeness', 'timestamp': 'Sun Mar 24 17:55:37 EET 2019', 'followers': []}\n",
      "{'user': 'maxthecat2000', 'timestamp': 'Sun Mar 24 17:56:23 EET 2019', 'followers': []}\n",
      "{'user': 'MaryC_mlc4123', 'timestamp': 'Sun Mar 24 17:56:53 EET 2019', 'followers': []}\n",
      "{'user': 'laleumen', 'timestamp': 'Sun Mar 24 18:01:57 EET 2019', 'followers': []}\n",
      "{'user': 'syringa11', 'timestamp': 'Sun Mar 24 18:03:02 EET 2019', 'followers': []}\n",
      "{'user': 'PolitiSmoose672', 'timestamp': 'Sun Mar 24 18:07:38 EET 2019', 'followers': []}\n",
      "{'user': 'wininmad', 'timestamp': 'Sun Mar 24 18:09:50 EET 2019', 'followers': []}\n",
      "{'user': 'evaleegifford11', 'timestamp': 'Sun Mar 24 18:14:44 EET 2019', 'followers': []}\n",
      "{'user': 'genezog7', 'timestamp': 'Sun Mar 24 18:40:35 EET 2019', 'followers': []}\n",
      "{'user': '7dnetwork', 'timestamp': 'Sun Mar 24 18:41:04 EET 2019', 'followers': []}\n",
      "{'user': 'princessearl1st', 'timestamp': 'Sun Mar 24 19:08:28 EET 2019', 'followers': []}\n",
      "{'user': 'LvnCali', 'timestamp': 'Sun Mar 24 19:10:47 EET 2019', 'followers': []}\n",
      "{'user': 'LvnCali', 'timestamp': 'Sun Mar 24 19:16:38 EET 2019', 'followers': []}\n",
      "{'user': 'mcp_pol', 'timestamp': 'Sun Mar 24 19:20:33 EET 2019', 'followers': ['StockScout1', 'PolitJunkieM']}\n",
      "{'user': 'santo_aol', 'timestamp': 'Sun Mar 24 19:35:49 EET 2019', 'followers': ['Johnnyrebaryah1']}\n",
      "{'user': 'RBRB1516', 'timestamp': 'Sun Mar 24 19:38:43 EET 2019', 'followers': []}\n",
      "{'user': 'maggievoelker', 'timestamp': 'Sun Mar 24 19:41:22 EET 2019', 'followers': []}\n",
      "{'user': 'Johnnyrebaryah1', 'timestamp': 'Sun Mar 24 19:41:41 EET 2019', 'followers': ['santo_aol']}\n",
      "{'user': 'DianaSc99717236', 'timestamp': 'Sun Mar 24 19:48:42 EET 2019', 'followers': []}\n",
      "{'user': 'Planelady1', 'timestamp': 'Sun Mar 24 20:08:44 EET 2019', 'followers': []}\n",
      "{'user': 'StockScout1', 'timestamp': 'Sun Mar 24 23:41:58 EET 2019', 'followers': ['Mr_Scorpio', 'FrenchieCat']}\n",
      "{'user': 'StockScout1', 'timestamp': 'Sun Mar 24 23:42:30 EET 2019', 'followers': ['Mr_Scorpio', 'FrenchieCat']}\n",
      "{'user': 'FrenchieCat', 'timestamp': 'Sun Mar 24 23:49:43 EET 2019', 'followers': ['Mr_Scorpio', 'StockScout1']}\n",
      "{'user': 'StockScout1', 'timestamp': 'Sun Mar 24 23:53:51 EET 2019', 'followers': ['Mr_Scorpio', 'FrenchieCat']}\n",
      "{'user': 'wil91116385', 'timestamp': 'Mon Mar 25 00:10:02 EET 2019', 'followers': []}\n",
      "{'user': 'gaelbill', 'timestamp': 'Mon Mar 25 00:23:04 EET 2019', 'followers': ['chatta_girl']}\n",
      "{'user': 'gaelbill', 'timestamp': 'Mon Mar 25 00:28:13 EET 2019', 'followers': ['chatta_girl']}\n",
      "{'user': 'chatta_girl', 'timestamp': 'Mon Mar 25 00:29:36 EET 2019', 'followers': ['gaelbill']}\n",
      "{'user': 'JohnnyHeldt', 'timestamp': 'Mon Mar 25 00:51:26 EET 2019', 'followers': ['StockScout1']}\n",
      "{'user': 'PolitJunkieM', 'timestamp': 'Mon Mar 25 01:48:07 EET 2019', 'followers': ['HerculesOlesen']}\n",
      "{'user': 'HerculesOlesen', 'timestamp': 'Mon Mar 25 01:52:26 EET 2019', 'followers': []}\n",
      "{'user': 'cornerboy102000', 'timestamp': 'Mon Mar 25 01:57:10 EET 2019', 'followers': []}\n",
      "{'user': 'purr10', 'timestamp': 'Mon Mar 25 02:01:54 EET 2019', 'followers': []}\n",
      "{'user': 'barbara_kobrin', 'timestamp': 'Mon Mar 25 02:13:28 EET 2019', 'followers': []}\n",
      "{'user': 'gramophoneman', 'timestamp': 'Mon Mar 25 02:30:11 EET 2019', 'followers': []}\n",
      "{'user': 'gramophoneman', 'timestamp': 'Mon Mar 25 02:31:06 EET 2019', 'followers': []}\n",
      "{'user': 'gramophoneman', 'timestamp': 'Mon Mar 25 02:31:09 EET 2019', 'followers': []}\n",
      "{'user': 'Longley321', 'timestamp': 'Mon Mar 25 02:41:24 EET 2019', 'followers': []}\n",
      "{'user': 'Nedk30', 'timestamp': 'Mon Mar 25 06:47:22 EET 2019', 'followers': []}\n",
      "{'user': 'MouseWithTimbs', 'timestamp': 'Sun Mar 24 18:26:14 EET 2019', 'followers': ['jasonaguilera94', 'jorge_9829']}\n",
      "{'user': 'nessunto', 'timestamp': 'Sun Mar 24 19:01:07 EET 2019', 'followers': []}\n",
      "{'user': 'ElFamosoMaximo_', 'timestamp': 'Sun Mar 24 19:29:57 EET 2019', 'followers': []}\n",
      "{'user': 'rosaram00', 'timestamp': 'Sun Mar 24 19:56:10 EET 2019', 'followers': []}\n",
      "{'user': 'YungMou', 'timestamp': 'Sun Mar 24 20:03:04 EET 2019', 'followers': []}\n",
      "{'user': 'jasonaguilera94', 'timestamp': 'Sun Mar 24 21:10:39 EET 2019', 'followers': []}\n",
      "{'user': 'virgopriestess', 'timestamp': 'Sun Mar 24 22:00:09 EET 2019', 'followers': []}\n",
      "{'user': 'Bronx_xD', 'timestamp': 'Sun Mar 24 22:00:32 EET 2019', 'followers': []}\n",
      "{'user': 'coco_pepps', 'timestamp': 'Sun Mar 24 23:05:23 EET 2019', 'followers': []}\n",
      "{'user': 'gamilaali12', 'timestamp': 'Sun Mar 24 23:29:18 EET 2019', 'followers': []}\n",
      "{'user': 'jorge_9829', 'timestamp': 'Sun Mar 24 23:41:48 EET 2019', 'followers': []}\n",
      "{'user': 'Twilightdrawing', 'timestamp': 'Mon Mar 25 00:11:37 EET 2019', 'followers': []}\n",
      "{'user': 'irvin_picazo', 'timestamp': 'Mon Mar 25 00:37:59 EET 2019', 'followers': []}\n",
      "{'user': '10kAntt', 'timestamp': 'Mon Mar 25 00:59:41 EET 2019', 'followers': []}\n",
      "{'user': 'SkullsTehOG', 'timestamp': 'Mon Mar 25 01:07:16 EET 2019', 'followers': []}\n",
      "{'user': 'kxtiegxlloway', 'timestamp': 'Mon Mar 25 01:44:46 EET 2019', 'followers': []}\n",
      "{'user': 'criissttaaal', 'timestamp': 'Mon Mar 25 01:50:15 EET 2019', 'followers': []}\n",
      "{'user': 'ayejulianaa', 'timestamp': 'Mon Mar 25 01:51:06 EET 2019', 'followers': []}\n",
      "{'user': 'raawgu', 'timestamp': 'Mon Mar 25 01:54:03 EET 2019', 'followers': []}\n",
      "{'user': 'asap_rocky__', 'timestamp': 'Mon Mar 25 02:05:30 EET 2019', 'followers': []}\n",
      "{'user': 'TNuttiez', 'timestamp': 'Mon Mar 25 06:45:05 EET 2019', 'followers': []}\n",
      "{'user': 'putopete13', 'timestamp': 'Mon Mar 25 06:46:33 EET 2019', 'followers': []}\n",
      "{'user': 'reservoirdawwgs', 'timestamp': 'Mon Mar 25 07:04:07 EET 2019', 'followers': []}\n",
      "{'user': 'MBaguenier', 'timestamp': 'Mon Mar 25 07:12:33 EET 2019', 'followers': []}\n",
      "{'user': 'tymorrowland', 'timestamp': 'Mon Mar 25 07:18:47 EET 2019', 'followers': []}\n",
      "{'user': 'inesreyes__', 'timestamp': 'Mon Mar 25 07:26:37 EET 2019', 'followers': []}\n",
      "{'user': 'AmineMadani_19', 'timestamp': 'Mon Mar 25 07:28:14 EET 2019', 'followers': []}\n",
      "{'user': 'artdioxide', 'timestamp': 'Mon Mar 25 07:31:35 EET 2019', 'followers': []}\n",
      "{'user': 'ShibeOwO', 'timestamp': 'Mon Mar 25 07:36:03 EET 2019', 'followers': []}\n",
      "{'user': 'mulantrbl', 'timestamp': 'Mon Mar 25 07:45:56 EET 2019', 'followers': []}\n",
      "{'user': 'medicenes', 'timestamp': 'Mon Mar 25 08:01:05 EET 2019', 'followers': []}\n",
      "{'user': 'wardboi01', 'timestamp': 'Mon Mar 25 08:06:46 EET 2019', 'followers': []}\n",
      "{'user': 'ZahnaMorel', 'timestamp': 'Mon Mar 25 08:10:49 EET 2019', 'followers': []}\n",
      "{'user': 'AceSphex', 'timestamp': 'Mon Mar 25 08:22:15 EET 2019', 'followers': []}\n",
      "{'user': '_UX123_', 'timestamp': 'Mon Mar 25 08:25:36 EET 2019', 'followers': []}\n",
      "{'user': '4everMotionless', 'timestamp': 'Mon Mar 25 08:27:45 EET 2019', 'followers': []}\n",
      "{'user': 'ODDEEYCIRCLE', 'timestamp': 'Mon Mar 25 08:37:25 EET 2019', 'followers': []}\n"
     ]
    }
   ],
   "source": [
    "# print(retrieve_tweet_story(1109874238398320640))\n",
    "# print(retrieve_users_who_interacted_at_a_story(1109874238398320640))\n",
    "# for value in retrieve_stories_made_by_user(politic_usa_id):\n",
    "#     print(value)\n",
    "#     print(\"HELLO DARKNESS WORLD\")\n",
    "#     print(\"\\n\")\n",
    "\n",
    "# print(retrieve_time_spread_of_tweet_story(tweet_id))\n",
    "\n",
    "# print(retrieve_users_who_interacted_at_a_story(tweet_id))\n",
    "# print(trial_and_error(tweet_id))\n",
    "\n",
    "listOfIds = [1109973027255664643,\n",
    "    1109953086108381185,\n",
    "    1109973771371376640,\n",
    "    1109983287240474624,\n",
    "    1109850542950531073,\n",
    "    1109790735367200773,\n",
    "    1109738825738117120,\n",
    "    1109922557959000064,\n",
    "    1109957082722250753,\n",
    "    1109940939555065857,\n",
    "    1110001365068251137,\n",
    "    1109791857775661056,\n",
    "    1109874238398320640,\n",
    "    1109884141581918208]\n",
    "for tw_id in listOfIds:\n",
    "#     print('hello')\n",
    "    results = get_users_from_tweet_story(tw_id)\n",
    "    obj = {\n",
    "            'user': results[0]['starter'],\n",
    "            'timestamp': results[0]['origin'],\n",
    "            'followers': []\n",
    "        }\n",
    "    listOfUsers = [obj]\n",
    "    for record in results:\n",
    "        obj = {\n",
    "            'user': record['user'],\n",
    "            'timestamp': record['timestamp'],\n",
    "            'followers': []\n",
    "        }\n",
    "        listOfUsers.append(obj)\n",
    "\n",
    "    # print(listOfUsers)\n",
    "    for user in listOfUsers:\n",
    "    #     followers = []\n",
    "        for i in range(1,len(listOfUsers) - 1):\n",
    "            if user['user'] != listOfUsers[i]['user'] and check_if_source_follows_target(listOfUsers[i]['user'], user['user']):\n",
    "                if listOfUsers[i]['user'] not in user['followers']:\n",
    "                    user['followers'].append(listOfUsers[i]['user'])\n",
    "    #     record['followers'] = followers\n",
    "    for record in listOfUsers:\n",
    "        print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "ename": "AttributeError",
     "evalue": "module 'networkx' has no attribute 'draw_networkx_egdes'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-28-2524a2108ee2>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     11\u001b[0m \u001b[0mnx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdraw_networkx_labels\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mG\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mpos\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     12\u001b[0m \u001b[0mnx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdraw_networkx_nodes\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mG\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mpos\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcmap\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mplt\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_cmap\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'jet'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnode_size\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;36m500\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 13\u001b[0;31m \u001b[0mnx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdraw_networkx_egdes\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mG\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mpos\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     14\u001b[0m \u001b[0mplt\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mshow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAttributeError\u001b[0m: module 'networkx' has no attribute 'draw_networkx_egdes'"
     ]
    }
   ],
   "source": [
    "import networkx as nx\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "G = nx.DiGraph()\n",
    "\n",
    "for user in listOfUsers:\n",
    "    for follower in user['followers']:\n",
    "        G.add_edge(user['user'], follower)\n",
    "        \n",
    "pos = nx.spring_layout(G)\n",
    "nx.draw_networkx_labels(G, pos)\n",
    "nx.draw_networkx_nodes(G, pos, cmap=plt.get_cmap('jet'), node_size = 500)\n",
    "nx.draw_networkx_egdes(G, pos)\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "# MATCH u=(user:User)-[r:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: 1109874238398320640, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "# WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "# WITH collect(user) as users, storyStarter, collect(end) as tweets, r, start\n",
    "# UNWIND users AS user\n",
    "# UNWIND tweets AS tweet\n",
    "# MATCH pa=(someone:User)-[:POSTED_REPLY|POSTED_RETWEET]->(post:Tweet)-[:REPLIED_TO|RETWEETED_FROM]->(tweet)<-[:POSTED_REPLY|POSTED_RETWEET]-(user)\n",
    "# WHERE post.created_at < tweet.created_at AND (exists((user)-[:FOLLOWS]->(someone)) OR exists((user)-[:FOLLOWS]->(storyStarter)))\n",
    "# RETURN someone, user\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "metadata": false,
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "# MATCH u=(user:User)-[r:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: 1109874238398320640, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "# WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "# RETURN u\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "metadata": false,
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "# MATCH u=(user:User)-[r:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: 1109874238398320640, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "# WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "# WITH collect(user) as users, storyStarter, collect(end) as tweets, r\n",
    "# RETURN users, storyStarter"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "metadata": false,
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "# MATCH u=(user:User)-[r:TWEETED|POSTED_REPLY|POSTED_RETWEET]->(end:Tweet)-[:REPLIED_TO|RETWEETED_FROM*]->(start:Tweet {id: 1109874238398320640, type: 'TWEET'})<-[:TWEETED]-(storyStarter:User)\n",
    "# WHERE end.type = 'RETWEET' OR end.type = 'REPLY'\n",
    "# WITH collect(user) as users, storyStarter, collect(end) as tweets, r, start\n",
    "# RETURN tweets, start"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
